{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">You'll gain an enhanced view of the security risk page allowing you to see a count per repository of security alerts by alert severity or security feature.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Today, enterprises users need to be able to view a total count of alerts by severity or by security feature for a group of repositories.</p>\n<p dir=\"auto\">This feature aims to give users dynamic views to enable users to quickly and easily identify the most critical security risks and prioritize their remediation efforts.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be presented with a toggle on the security risk page to switch between two different row-level presentations: a sum of alerts by alert severity across all security features, and a sum of alerts by security feature across all alert severities.</p>",
            "url": "https://github.com/github/roadmap/issues/886",
            "title": "Enhancing the security risk page with grouped alert counts",
            "date_modified": "2023-12-20T19:01:01.000Z",
            "date_published": "2023-12-20T19:01:01.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are providing users with the ability to set column limits on the board layout, based off of the number of items in a specific board column. These can be set per column, and are unique to each board layout.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By setting and visually highlighting limits on the number of items in a column on a board, users and teams will be able to prioritize their work through the different stages of development. This will increase focus and clarity on the most important work items.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to set a per-column limit for the number of work items in a board column that is unique to each board. The count of items and column limit will be surfaced at the top of a board column in a pill (ex: <code class=\"notranslate\">4/8</code>), and it will be visually highlighted when the limit is reached to indicate to a user that they have reached the limit. Users will not be restricted to moving new items to a column, so it acts as a \"soft\" limit.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498133-f3d38a46-3f04-4eea-9df9-316b2141be93.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498133-f3d38a46-3f04-4eea-9df9-316b2141be93.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498481-05f77806-ceb5-48f9-aa44-9f1e1d312d5a.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498481-05f77806-ceb5-48f9-aa44-9f1e1d312d5a.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/885",
            "title": "Projects: Board column limits",
            "date_modified": "2023-12-20T19:00:58.000Z",
            "date_published": "2023-12-20T19:00:58.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are providing users with the ability to specify a field as a swimlane on their boards, allowing them to view their items in a horizontal grouping to visually separate and distinguish between work that belongs to different workstreams, team members, or priorities.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By providing users with the ability to specify a field as a swimlane on their boards, we can help them with tasks such as</p>\n<ul dir=\"auto\">\n<li>Viewing high priority items alongside items with lower priority, to help draw attention to the most important work and what requires immediate attention</li>\n<li>Viewing different work streams side-by-side to view the progress of the work for ongoing projects and across teams in a single view</li>\n<li>Viewing items across team members to see how work breaks down within the team and how it is progressing together</li>\n</ul>\n<p dir=\"auto\">This swimlane view gives users a single zoomed out or stacked view that allows them to stay in one place, without losing the context of how this work compares to each other and is progressing together.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to specify a field as a swimlane that is unique to each board. The swimlanes act as a horizontal grouping on board layouts, and items will be able to be moved between swimlanes to make adjustments and update the field value.</p>",
            "url": "https://github.com/github/roadmap/issues/884",
            "title": "Projects: Board swimlanes",
            "date_modified": "2023-12-20T19:00:55.000Z",
            "date_published": "2023-12-20T19:00:55.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Users will be able to select a <code class=\"notranslate\">Slice by</code> field that pulls all field values into a panel on the left side, with the project items associated with those values in the view on the right side. Clicking through the values in the panel will filter and adjust the items that appear in the view, allowing users to quickly page through their items and make adjustments.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498137-d9c71624-054e-4e38-9da5-af6cff01f9ff.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498137-d9c71624-054e-4e38-9da5-af6cff01f9ff.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By providing users with the ability to create this view on their projects, we can help them accomplish tasks such as</p>\n<ul dir=\"auto\">\n<li>Visually separating and breaking down epics from the individual tasks by the <code class=\"notranslate\">Tracked by</code> field, giving a hierarchical view of your items powered by <a href=\"https://docs.github.com/en/issues/tracking-your-work-with-issues/about-tasklists\">tasklists</a> to understand how larger work items are progressing in a single view</li>\n<li>Planning out current and upcoming iterations by the <code class=\"notranslate\">Iteration</code> field, allowing users to quickly make adjustments to when work will begin if plans change</li>\n<li>Understanding team capacity with by the <code class=\"notranslate\">Assignee</code> field, breaking down work items by each distinct assignee and giving an easy canvas to move items between team members to reassign work</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to specify a <code class=\"notranslate\">Slice by</code> field on any of their table, board, or roadmap layouts. The panel allows a user to select a value from the list that populates and filters the work items that appear in the view on the right.</p>",
            "url": "https://github.com/github/roadmap/issues/883",
            "title": "Projects: Configure a `Slice by` field",
            "date_modified": "2023-12-20T19:00:52.000Z",
            "date_published": "2023-12-20T19:00:52.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">With ISO 27001 as a foundation, GitHub is able to register as a participant in the Trusted Information Security Assessment Exchange (TISAX).</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">GitHub will achieve TISAX Assessment Level 2 for the assessment objectives and resulting TISAX labels of \"Handling of information with high protection needs\" and \"Data protection\". The outcome of this work is that GitHub Enterprise Cloud customers will be able to use GitHub to develop software while meeting TISAX compliance obligations.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">GitHub GRC has already begun the registration process by registering as a TISAX Participant and we have defined an assessment scope. Next up, GRC is working with to identify a TISAX audit provider and will then undergo a TISAX assessment. The results of GitHub's assessment will then be made available to TISAX partners. Once certified, GitHub will add TISAX to customer facing documentation portals.</p>",
            "url": "https://github.com/github/roadmap/issues/882",
            "title": "TISAX Compliance for Dotcom and GHEC",
            "date_modified": "2023-12-20T19:00:49.000Z",
            "date_published": "2023-12-20T19:00:49.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Automatically enable the detection of transitive dependencies for Maven with a one-click set up through a repository's settings.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Dependency graph currently does not automatically detect transitive dependencies for Maven. Users can use a GitHub Action to detect and submit these dependencies to the dependency graph, but the discoverability of this action is low and the configuration hurdle can be high. A one-click enablement eliminates these hurdles for users and provides the dependency information they need.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Enabling Maven transitive dependency detection through a repository's settings page will run the <a href=\"https://github.com/marketplace/actions/maven-dependency-tree-dependency-submission\">Maven Dependency Submission Action</a> using dynamic workflows. The repository will show the complete Maven dependencies in the dependency graph, and users will received Dependabot alerts for any known vulnerabilities. Users do not need to configure their own workflow files.</p>\n<p dir=\"auto\">The initial release will be enablement at the repository level only. Future ships will include leveraging other detectors for other ecosystems and organisation-level enablement.</p>",
            "url": "https://github.com/github/roadmap/issues/881",
            "title": "One-click enablement for Maven transitive dependency detection (beta)",
            "date_modified": "2023-12-20T19:00:46.000Z",
            "date_published": "2023-12-20T19:00:46.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning default setup will automatically attempt to analyze all CodeQL supported languages in a repository. Repositories no longer need to manually choose to include compiled languages in the default setup configuration. If a language fails it will be automatically deselected from the configuration, and the  analysis and any alerts from the successful languages will be available.</p>\n<p dir=\"auto\">This will ship at the repository and organization level.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Code scanning default setup automatically sets up the best possible configuration for your repository to get started easily with CodeQL.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">All CodeQL supported languages will be selected automatically by code scanning default setup, and automatically removed from the configuration if they fail. The \"edit configuration\" page allows users to see which languages are included in the configuration and apply any customization if required.</p>",
            "url": "https://github.com/github/roadmap/issues/880",
            "title": "Code scanning default setup automatically includes all CodeQL supported languages",
            "date_modified": "2023-12-20T19:00:43.000Z",
            "date_published": "2023-12-20T19:00:43.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">New methods for threat modelling in CodeQL will allow any security-minded user to create CodeQL model packs containing models for libraries and frameworks, to help make sure code scanning alerts are relevant to them and their codebases.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">No individual SAST vendor can model all the world’s frameworks and libraries. The out-of-the-box CodeQL threat models provide great coverage for identifying large numbers of potential vulnerabilities in codebases using code scanning. However, there are cases which are not covered by CodeQL's models (e.g, custom-built web frameworks, database libraries) and when a framework is missing, or a taint source/sink is not recognised, then code scanning may miss important results.</p>\n<p dir=\"auto\">With CodeQL model packs, users who are familiar with their project's threat model will be able to add CodeQL support for any Java frameworks that aren't modeled by default to help overcome cases of missing results.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to create CodeQL model packs containing data models of the their libraries and frameworks which can easily be included in their code scanning analyses.</p>",
            "url": "https://github.com/github/roadmap/issues/879",
            "title": "Use CodeQL model packs to easily add code scanning support for libraries and frameworks (Java)[beta]",
            "date_modified": "2023-12-20T19:00:40.000Z",
            "date_published": "2023-12-20T19:00:40.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">New CodeQL threat model settings will allow security-minded users to configure additional local sources of taint to use in code scanning if required by their codebase. The first language to support this functionality in CodeQL will be Java.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">No two codebases are the same and each has a different threat model, depending on it has been designed and how it's deployed. For example, one codebase might only consider remote HTTP requests tainted to be potentially untrusted, whereas another might also consider local files to be a source of tainted user data. CodeQL can perform security analysis on all such codebases, but it needs to behave slightly differently in each case. If we fail to include types of taint source that are relevant to a codebase, then we may miss important results (false negatives). Conversely, if we include types of taint source that are irrelevant, then we may generate too many results (false positives).</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">With CodeQL threat model settings, code scanning users will be able to configure which types of tainted data to use in code scanning in the UI. CodeQL CLI users will be able to specify threat model settings on the command line.</p>",
            "url": "https://github.com/github/roadmap/issues/878",
            "title": "CodeQL threat models are configurable in order to enable/disable sources of taint in code scanning (Java)[beta]",
            "date_modified": "2023-12-20T19:00:37.000Z",
            "date_published": "2023-12-20T19:00:37.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, all status checks configured as \"required\" for a branch in branch protections or repository rules must pass before a pull request can be merged or added to the queue. These same checks must also pass before a change is merged by the queue. Sometimes it's unnecessary to run certain checks in both places, but there's currently no way around this if the status check is required.</p>\n<p dir=\"auto\">There are also cases where different sets of status checks need to be run based on the changes made in the pull request. This is usually done to reduce CI time and cost and ensure only necessary status checks are run. However, a status check that does not always run cannot be configured as required since it would block merging of changes were the check wasn't run.</p>\n<p dir=\"auto\">The solution is giving teams more ways to configure which status checks are required in different contexts and without having to configure a fixed set of status checks upfront.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<ul dir=\"auto\">\n<li>Reduce CI costs by not running unnecessary checks</li>\n<li>Reduce time-to-merge</li>\n<li>Avoid requirement to use custom apps and workflows to rollup and report summary when the set of required checks is variable</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Admins have other options for choosing which status checks are required. For example, one option may be to require all reported status checks must pass.</p>",
            "url": "https://github.com/github/roadmap/issues/877",
            "title": "More control over required status checks for pull requests using merge queue",
            "date_modified": "2023-12-20T19:00:34.000Z",
            "date_published": "2023-12-20T19:00:34.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">This ship brings auto-triage rules to the organization-level.</p>\n<p dir=\"auto\">Organization admins can set enforcement for GitHub presets across all of an organization's repositories or create and enforce custom auto-triage rules.</p>",
            "url": "https://github.com/github/roadmap/issues/876",
            "title": "Dependabot Alerts: Organization-Level Alert Rules (beta)",
            "date_modified": "2023-12-20T19:00:31.000Z",
            "date_published": "2023-12-20T19:00:31.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Following the delivery of repository and organization level custom roles and fine-grained permissions, we will deliver this same model at the enterprise level.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Least-privilege permissions are important at every layer of account access, from apps to users. Enterprise roles will allow more people to get work done at the enterprise level, without exposing enterprise customers to more risk by granting the highly privileged <code class=\"notranslate\">enterprise owner</code> role.</p>\n<p dir=\"auto\">While most users don't need to interact with the enterprise, there are quite a few highly-sensitive actions that enterprise administrators take, such as <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/identity-and-access-management/using-saml-for-enterprise-iam/configuring-saml-single-sign-on-for-your-enterprise\">setting up SAML</a>, <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/user-management/managing-organizations-in-your-enterprise/adding-organizations-to-your-enterprise\">creating organizations</a>, and <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/exploring-user-activity/managing-global-webhooks\">registering webhooks</a>. We will allow enterprise administrators to enable a member to do one of these things without letting them do all of them, to reduce their risk profile.</p>\n<p dir=\"auto\">There are also less-risky activities, such as <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/about-the-audit-log-for-your-enterprise\">reading the audit log</a>, <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/user-management/managing-users-in-your-enterprise/customizing-user-messages-for-your-enterprise\">putting up announcement banners</a>, and <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/configuration/configuring-your-enterprise/verifying-or-approving-a-domain-for-your-enterprise\">verifying domains for members</a>. To reduce friction while getting things done, enterprise administrators will be able to grant these permissions to members widely (as needed) without worrying about providing broad access to highly privileged actions.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Like repository and organization custom roles, enterprise owners will be able to create custom roles that contain a set of permissions against the enterprise object. Fine-grained permissions, such as those listed in the examples above, will be made available to craft these custom roles. These enterprise-level fine-grained permissions will work against the UK and API. When assigned to a member of an enterprise, an enterprise-level custom role will allow the user to access certain parts of the enterprise settings, and take certain actions, depending on the permissions in the role.</p>",
            "url": "https://github.com/github/roadmap/issues/875",
            "title": "Enterprise custom roles and permissions (beta)",
            "date_modified": "2023-12-20T19:00:28.000Z",
            "date_published": "2023-12-20T19:00:28.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Dependabot version updates creates updates to proactively update out-of-date dependencies. It currently creates one pull request per dependency, but that doesn't make sense for every repository. This feature will allow maintainers to configure their updates to group certain sets of dependencies together.</p>\n<p dir=\"auto\">This is a continuation from the public beta: <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"785401555\" data-permission-text=\"Title is private\" data-url=\"https://github.com/github/roadmap/issues/148\" data-hovercard-type=\"issue\" data-hovercard-url=\"/github/roadmap/issues/148/hovercard\" href=\"https://github.com/github/roadmap/issues/148\">#148</a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This will help developers better manage the many PRs that Dependabot opens.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Once the developer specifies grouping rules in their <code class=\"notranslate\">dependabot.yml</code> file, they will start seeing Dependabot open PRs with multiple dependencies based on those rules.</p>",
            "url": "https://github.com/github/roadmap/issues/874",
            "title": "Dependabot Grouped Version Updates GA",
            "date_modified": "2023-12-20T19:00:25.000Z",
            "date_published": "2023-12-20T19:00:25.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">As an enterprise customer, you have the ability to assign the security manager role to any team in an organization. When applied, it gives every member of that team permissions to manage security alerts and settings across your organization, as well as read all repositories in the organization. Further, you have the ability to create repository-level custom security roles with any of the following security manager permissions to a user or team:</p>\n<ul dir=\"auto\">\n<li>View secret scanning</li>\n<li>Dismiss secret scanning</li>\n<li>View code scanning</li>\n<li>Dismiss code scanning</li>\n<li>Delete code scanning alerts</li>\n<li>View Dependabot alerts</li>\n<li>Dismiss Dependabot alerts</li>\n</ul>\n<p dir=\"auto\">Enterprises wanting more personalized control over security manager permissions for their organization will benefit from upcoming enhancements. The enhancements will offer advanced control over security permissions, meeting growing demands for custom access levels.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This feature aims to give you advanced control over security permissions, accommodating your increasing need for customized access levels.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">The security manager role will continue to exist, but will be enhanced so that you can assign the role to individual users in addition to teams at the organization level.</p>\n<p dir=\"auto\">Moreover, enterprises will be able to create customized security manager roles at the organization level using the listed security permissions. These custom roles can have a combination of organization-wide permissions (like viewing the organization's audit log) and repository-specific permissions (such as allowing Dependabot alert view access) for all organization's repositories. Learn more about <a href=\"https://github.com/github/roadmap/issues/586\" data-hovercard-type=\"issue\" data-hovercard-url=\"/github/roadmap/issues/586/hovercard\">organization custom roles</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/873",
            "title": "Security manager improvements and custom organization security roles (beta)",
            "date_modified": "2023-12-20T19:00:22.000Z",
            "date_published": "2023-12-20T19:00:22.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The audit log API endpoint will impose a rate limit of 15 queries per minute per enterprise or org starting August 1st, 2023. To prepare for this change, Enterprises and Organizations currently exceeding this limit should ensure individuals, applications and integrations querying the audit log API:</p>\n<ul dir=\"auto\">\n<li>Query at a maximum frequency of 15 queries per minute, and/or;</li>\n<li>Honor HTTP 429 and HTTP 403 responses, as outline in our documentation for <a href=\"https://docs.github.com/en/rest/overview/resources-in-the-rest-api?apiVersion=2022-11-28#rate-limiting\">rate limits for requests from personal accounts</a> and <a href=\"https://docs.github.com/en/apps/creating-github-apps/registering-a-github-app/rate-limits-for-github-apps\">rate limits for GitHub Apps</a></li>\n</ul>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">A high-quality audit log is an essential tool used by enterprises to ensure compliance, maintain security, investigate issues, and promote accountability. To support these objectives, the audit log API needs to be highly reliable, consistently available, and extremely scalable. The new rate limit safeguards the audit log APIs availability and scalability by providing back pressure to individuals, applications, or integrations querying the audit log APIs.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When the 15 query per minute rate limit is exceeded, the audit log API will return either a HTTP 429 or HTTP 403 response indicating that a rate limit has been reached. When these responses are received, the querying entity should wait at least 4 seconds before attempting to query the audit log API again.</p>",
            "url": "https://github.com/github/roadmap/issues/872",
            "title": "New rate limit for the audit log API endpoints",
            "date_modified": "2023-12-20T19:00:19.000Z",
            "date_published": "2023-12-20T19:00:19.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects built with Java 21.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\">CodeQL supports Java language features up to Java 20</a>. Java version 21 is due to be released before the end of 2023. Adding support to CodeQL will allow users of Java 21 to benefit from CodeQL's comprehensive security analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains code that uses Java 21 language features, CodeQL will be able to scan the code. As soon as the analysis is finished, the CodeQL results will become visible to you in the \"Security\" tab and on pull requests. Java 21 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a> and <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-codeql\" rel=\"nofollow\">CodeQL VS Code extension</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/871",
            "title": "Code scanning with CodeQL supports Java 21",
            "date_modified": "2023-12-20T19:00:16.000Z",
            "date_published": "2023-12-20T19:00:16.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects built with Kotlin 2.0.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\">CodeQL supports Kotlin language features up to Kotlin 1.9</a>. Kotlin version 2.0 is due to be released before the end of 2023. Adding support to CodeQL will allow users of Kotlin 2.0 to benefit from CodeQL's comprehensive security analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains code that uses Kotlin 2.0 language features, CodeQL will be able to scan the code. As soon as the analysis is finished, the CodeQL results will become visible to you in the \"Security\" tab and on pull requests. Kotlin 2.0 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a> and <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-codeql\" rel=\"nofollow\">CodeQL VS Code extension</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/870",
            "title": "Code scanning with CodeQL supports Kotlin 2.0",
            "date_modified": "2023-12-20T19:00:13.000Z",
            "date_published": "2023-12-20T19:00:13.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects built with Ruby 3.3.</p>\n<p dir=\"auto\">Note: Ruby 3.3 is currently in preview and start of this work is pending a stable release.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\">CodeQL supports Ruby language features up to and including Ruby 3.2</a> (the latest stable release of the language). Adding support to CodeQL will allow users of Ruby 3.3 to benefit from CodeQL's comprehensive security analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains code that uses Ruby 3.3 language features, CodeQL will be able to scan the code. As soon as the analysis is finished, the CodeQL results will become visible to you in the \"Security\" tab and on pull requests. Ruby 3.3 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a> and <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-codeql\" rel=\"nofollow\">CodeQL VS Code extension</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/869",
            "title": "Code scanning with CodeQL supports Ruby 3.3",
            "date_modified": "2023-12-20T19:00:10.000Z",
            "date_published": "2023-12-20T19:00:10.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects built with Swift 5.9.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\">CodeQL supports Swift language features up to and including Swift 5.8.1</a>. Swift version 5.9 is due to be released before the end of 2023. Adding support to CodeQL will allow users of Swift 5.9 to benefit from CodeQL's comprehensive security analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains code that uses Swift 5.9 language features, CodeQL will be able to scan the code. As soon as the analysis is finished, the CodeQL results will become visible to you in the \"Security\" tab and on pull requests. Swift 5.9 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a> and <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-codeql\" rel=\"nofollow\">CodeQL VS Code extension</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/868",
            "title": "Code scanning with CodeQL supports Swift 5.9",
            "date_modified": "2023-12-20T19:00:07.000Z",
            "date_published": "2023-12-20T19:00:07.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Customers can now configure a list of IP address or domains that are allowed to be accessible by GitHub-hosted runners.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This feature allows platform administrators to control their Enterprise or org-owned GitHub-hosted runners to only access approved destinations while blocking access to everything else giving them control on the network security of their build machines. This also enables teams to run workflows on GitHub-hosted runners that require access to private resources (private artifact repository, on-prem test database, cloud-based storage etc.) as software is deployed.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Platform administrators can enter a range of allowed IPs or domains while configuring a runner group. All runners created as part of that runner group will inherit the outbound allow-list and will only be able to reach the approved destinations.</p>",
            "url": "https://github.com/github/roadmap/issues/867",
            "title": "Actions: Outbound network control for GitHub-hosted runners",
            "date_modified": "2023-12-20T19:00:04.000Z",
            "date_published": "2023-12-20T19:00:04.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}