{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/84993853?v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Discussed in <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"7579072\" data-permission-text=\"Title is private\" data-url=\"https://github.com/github/roadmap/discussions/1069\" data-hovercard-type=\"discussion\" data-hovercard-url=\"/github/roadmap/discussions/1069/hovercard\" href=\"https://github.com/github/roadmap/discussions/1069\">#1069</a></h3>\n<div type=\"discussions-op-text\" dir=\"auto\">\n<p dir=\"auto\"><sup>Originally posted by <strong>Lukasz114</strong> November 29, 2024</sup></p>\n<h3 dir=\"auto\"><a href=\"url\">#****</a></h3></div>",
            "url": "https://github.com/github/roadmap/issues/1070",
            "title": "Tytuł",
            "date_modified": "2024-11-29T16:10:32.000Z",
            "date_published": "2024-11-29T16:10:32.000Z",
            "author": {
                "name": "Lukasz114",
                "url": "https://github.com/Lukasz114"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Delegated alert dismissal helps security teams with lower tolerance for risk by providing additional controls and visibility around alert dismissals. Enterprise teams with security, auditing, and compliance requirements can now control who can close alerts, when and how alerts can be closed, and who can approve this activity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Delegated alert dismissal will 1) increase accountability across development teams when it comes to addressing alerts, 2) prevent insecure activity (e.g. mistakes or malicious action internally), and 3) improve the ability to manage alerts at scale, by making alert activity easier to govern.</p>",
            "url": "https://github.com/github/roadmap/issues/1063",
            "title": "Delegated alert dismissal for Code Scanning [GA]",
            "date_modified": "2024-11-21T20:38:38.000Z",
            "date_published": "2024-11-21T18:53:00.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Delegated alert dismissal helps security teams with lower tolerance for risk by providing additional controls and visibility around alert dismissals. Enterprise teams with security, auditing, and compliance requirements can now control who can close alerts, when and how alerts can be closed, and who can approve this activity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Delegated alert dismissal will 1) increase accountability across development teams when it comes to addressing alerts, 2) prevent insecure activity (e.g. mistakes or malicious action internally), and 3) improve the ability to manage alerts at scale, by making alert activity easier to govern.</p>",
            "url": "https://github.com/github/roadmap/issues/1062",
            "title": "Delegated alert dismissal for code scanning [Public Preview]",
            "date_modified": "2024-11-21T20:38:47.000Z",
            "date_published": "2024-11-21T18:50:41.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">The new enterprise security manager role is designed to give your AppSec team comprehensive oversight across your entire enterprise—streamlining security management for large-scale organizations. Rather than manually configuring security settings for each individual organization, this role enables a single, centralized team to enforce security policies, monitor alerts, and access critical security data across all organizations in one unified view.</p>\n<p dir=\"auto\">Additionally, this is a game-changer for GHES customers, who often manage security across dozens or even hundreds of organizations. By eliminating the need to set up security managers for each organization individually, the enterprise security manager role allows your team to oversee security operations across all organizations in the enterprise in just a few clicks—delivering faster, more consistent protection at scale.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Our enterprise customers have expressed a more streamlined way to empower their security-focused teams without the added complexity of adding a security manager team to each organization. Moreover, these teams often require access to enterprise-level policies and security settings, which traditionally have been reserved for the enterprise owner or granted only partially. This new role addresses these needs by providing:</p>\n<ul dir=\"auto\">\n<li>Simplified, centralized access management across all organizations with just a few clicks.</li>\n<li>Expanded permissions that encompass both organization-level and enterprise-level oversight and control.</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/1061",
            "title": "Enterprise security manager [Public Preview]",
            "date_modified": "2024-11-21T20:39:19.000Z",
            "date_published": "2024-11-20T23:41:18.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">GitHub Copilot RAI introduces advanced Responsible AI (RAI) filters and user experience enhancements, ensuring that code completions are safe, relevant, and high-quality. By incorporating multi-class filtering, adversarial prompt benchmarks, and improved grounding evaluations, Copilot RAI significantly reduces false positives and harmful content in code suggestions. This empowers developers to receive accurate and trustworthy code completions, fostering a more secure and efficient coding environment.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With GitHub Copilot RAI, development teams can expect a substantial decrease in over-filtering and false positives, leading to more precise and relevant code completions. The enhanced filtering capabilities and adversarial prompt benchmarks will help developers maintain high standards of code quality and security. This results in a more streamlined and productive coding experience, allowing teams to focus on innovation while ensuring compliance with safety and ethical guidelines.</p>",
            "url": "https://github.com/github/roadmap/issues/1060",
            "title": "GitHub Copilot RAI: Advancing Responsible AI for Safer, Smarter Code Suggestions [GA]",
            "date_modified": "2024-11-21T20:39:24.000Z",
            "date_published": "2024-11-20T23:39:45.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">GitHub is creating a complete enterprise context that will simplify administration at scale and improve the experience managing user and integration access to multiple organizations. In this public preview we are granting access to several features in one experience:</p>\n<ul dir=\"auto\">\n<li>Enterprise Custom Roles</li>\n<li>Enterprise Fine-Grained Permissions (FGP)</li>\n<li>Enterprise Teams</li>\n<li>Enterprise Apps</li>\n</ul>\n<p dir=\"auto\">All Enterprise-level features, current and future, will support the fine-grained permissions model, for both user roles and GitHub App installations. The result is that enterprise administrators can delegate their work safely to other users in their enterprise or GitHub Apps for automation.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">We are enabling a least-privilege, custom role-based access control model that works well in multi-org enterprise deployments. Permissions are granular enough to let you grant access via roles, to teams and apps, that is no more than what is required to get a specific job done.</p>\n<p dir=\"auto\">During this preview program we will continue to add more FGP and API coverage to comprehensively address needs for enterprise administration at scale. We expect that administrators will consolidate many organization teams to a more manageable set of enterprise teams deployed to multiple organizations. We want to see more enterprises, especially those with very large single organizations, take advantage of these features and create additional organizations to logically group their work.</p>",
            "url": "https://github.com/github/roadmap/issues/1059",
            "title": "Enterprise Roles, Permissions, Apps, and Teams [Public Preview]",
            "date_modified": "2024-11-21T20:39:32.000Z",
            "date_published": "2024-11-20T23:38:19.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Taking Copilot Extensions to GA expands access to all developers and organizations (with supported plan and account types) to build and use Copilot Extensions on GitHub Mobile, driving a more open, innovation-friendly ecosystem around GitHub Copilot. By moving beyond Public Preview, we aim to empower a broader developer community to create valuable, integrated tools, enhancing the utility and context of Copilot for users on GitHub Mobile.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">The GA launch will expand developers' ability to stay productive on the go by making Copilot Extensions available on GitHub Mobile.</p>",
            "url": "https://github.com/github/roadmap/issues/1058",
            "title": "Copilot Extensions - GitHub Mobile [GA]",
            "date_modified": "2024-11-21T20:39:37.000Z",
            "date_published": "2024-11-20T23:36:22.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Security campaigns help users of <a href=\"https://docs.github.com/en/get-started/learning-about-github/about-github-advanced-security\">GitHub Advanced Security</a> rapidly reduce their backlog of application security debt. By leveraging Copilot Autofix to generate contextual explanations and code suggestions for up to 1,000 historical code scanning alerts at a time, security campaigns help developers and security teams collaborate to fix vulnerabilities with speed and confidence.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Using security campaigns, organizations can expect to effectively and rapidly remove their long-standing security debt through increased collaboration and engagement between security teams and devs and the application of Copilot Autofix capabilities at scale.</p>",
            "url": "https://github.com/github/roadmap/issues/1057",
            "title": "Security campaigns with Copilot Autofix [GA]",
            "date_modified": "2024-11-21T20:39:42.000Z",
            "date_published": "2024-11-20T23:34:15.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">The fully generated SDKs for Go and .NET will be released in general availability (GA). This follows the preview version that GitHub introduced several months ago in the blog post <a href=\"https://github.blog/2024-01-03-our-move-to-generated-sdks/\" rel=\"nofollow\">Our Move to Generated SDKs</a>. In this release, the SDKs will be production-ready and offer significant enhancements:</p>\n<ul dir=\"auto\">\n<li><strong>Broader API support:</strong> Easily access more GitHub API endpoints than with previous SDKs.</li>\n<li><strong>Automatic rate limit management:</strong> Avoid exceeding API rate limits with built-in adjustments based on HTTP response headers.</li>\n<li><strong>Simplified authentication:</strong> Easily authenticate as a GitHub App, enabling finer-grained permissions and higher primary API rate limits for Enterprise Cloud accounts.</li>\n</ul>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">By adopting the GA generated SDKs for Go and .NET, teams will be more productive at integrating with GitHub using expanded and up-to-date API support, enjoy more stable integrations with automatic rate limit handling, and leverage higher rate limits and fine-grained security controls through simplified GitHub App authentication.</p>",
            "url": "https://github.com/github/roadmap/issues/1056",
            "title": "Generated SDKs for Go and .NET [GA]",
            "date_modified": "2024-11-21T20:39:52.000Z",
            "date_published": "2024-11-20T23:31:33.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">A new API endpoint will surface a repository's secret scanning scan history, providing information on backfill scans for different content types and patterns, as well as the latest incremental scan. The audit log and webhooks will have a new event when a backfill scan is completed in a repository.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Scan history information gives security teams insight into the secret scanning activity in their repositories and assurance that scans are running as expected.</p>",
            "url": "https://github.com/github/roadmap/issues/1055",
            "title": "Secret scanning scan history is surfaced in the REST API, audit logs, and webhooks [Public Preview]",
            "date_modified": "2024-11-21T20:39:56.000Z",
            "date_published": "2024-11-20T23:29:33.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">GitHub hosted GPU runners now offer expanded sizing and GPU card options. With this release we are adding 4 new GPU skus to our hosted runner fleet. These runners offer more vCPUs, multi-gpus and larger vRAM for customers that need more power and the ability to test across multiple GPUs.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Pipelines that need a more powerful GPU card for testing, need to test across multiple gpus, or require a larger amount of vRAM, can utilize these new GPU runner skus to run natively within Actions.</p>",
            "url": "https://github.com/github/roadmap/issues/1054",
            "title": "Multi-gpu and larger vRAM GPU runners [Public Preview]",
            "date_modified": "2024-11-21T20:40:01.000Z",
            "date_published": "2024-11-20T23:27:17.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h4 dir=\"auto\">Value Proposition</h4>\n<p dir=\"auto\">The Copilot Chat Model Picker allows developers to choose from a variety of industry-leading models, including GPT-4o, o1, Claude, and Gemini - directly within their preferred development environments such as VS Code, Visual Studio, JetBrains IDEs, and GitHub.com. This flexibility empowers developers to select the best-performing model for their specific tasks, enhancing the quality of Copilot Chat responses. Additionally, early adopters can experiment with the latest models as soon as they are released, staying ahead of the competition and driving innovation within their teams.</p>\n<h4 dir=\"auto\">Customer Outcome</h4>\n<p dir=\"auto\">By leveraging the Copilot Chat Model Picker, development teams can expect increased engagement and satisfaction as they tailor their Copilot Chat experiences to fit their unique needs. Organizations will see a rise in daily active users utilizing the model picker, leading to higher adoption rates and improved customer satisfaction. Early adopters will benefit from immediate access to cutting-edge models, enabling them to experiment and innovate more rapidly within their familiar development environments. Overall, this feature will contribute to a more customizable and efficient development workflow.</p>",
            "url": "https://github.com/github/roadmap/issues/1053",
            "title": "Copilot Model Picker [GA]",
            "date_modified": "2024-11-21T20:40:14.000Z",
            "date_published": "2024-11-20T23:26:00.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">The GitHub Copilot Extensibility Platform enables both first-party and third-party developers to enhance Copilot’s capabilities by integrating external tools and data sources directly into the development workflow. This lets users perform complex, orchestrated tasks beyond code and text generation, bringing external tools right into Copilot Chat. With extensions in GA, developers can rely on improved platform stability, clear support SLAs, OIDC support, transparent messages about data access limits, and availability across new environments like Mobile and JetBrains(with more to come).</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">As Copilot Extensions move into GA, developers and organizations can now tailor Copilot’s capabilities to fit their unique tech stack, boosting productivity across teams. Admins can control over which GitHub organization and repository data is accessible to extensions through app authorizations, with transparent messages around permission gates. Organizations can also build and share private, enterprise-grade extensions, ensuring consistency and streamlined workflows across teams and projects. This enables secure, efficient task automation and context retrieval, cutting down research time and accelerating developer velocity.</p>",
            "url": "https://github.com/github/roadmap/issues/1049",
            "title": "Copilot Extensions [GA]",
            "date_modified": "2024-11-21T20:40:51.000Z",
            "date_published": "2024-11-20T23:16:52.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Non-provider patterns are generic detectors that help you uncover secrets outside of patterns tied to specific token issuers, like HTTP authentication headers, connection strings, and private keys.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Non-provider patterns give security teams broader visibility into any secrets leaked in their repositories.</p>",
            "url": "https://github.com/github/roadmap/issues/1048",
            "title": "Secret scanning: non-provider patterns - [GA]",
            "date_modified": "2024-11-21T20:40:57.000Z",
            "date_published": "2024-11-20T23:11:03.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Delegated alert closures help security teams with lower tolerance for risk by providing additional controls and visibility around alert closures. Enterprise teams with security, auditing, and compliance requirements can now control who can close alerts, when and how alerts can be closed, and who can approve this activity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Delegated alert closures will 1) increase accountability across their development teams when it comes to addressing alerts, 2) prevent insecure activity (e.g. mistakes or malicious action internally), and 3) improve ability to manage alerts at scale, by making alert activity easier to govern.</p>",
            "url": "https://github.com/github/roadmap/issues/1047",
            "title": "Delegated alert closures for secret scanning [GA]",
            "date_modified": "2024-11-21T20:41:02.000Z",
            "date_published": "2024-11-20T23:09:27.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Delegated alert closures help security teams with lower tolerance for risk by providing additional controls and visibility around alert closures. Enterprise teams with security, auditing, and compliance requirements can now control who can close alerts, when and how alerts can be closed, and who can approve this activity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Delegated alert closures will 1) increase accountability across their development teams when it comes to addressing alerts, 2) prevent insecure activity (e.g. mistakes or malicious action internally), and 3) improve ability to manage alerts at scale, by making alert activity easier to govern.</p>",
            "url": "https://github.com/github/roadmap/issues/1046",
            "title": "Delegated alert closures for secret scanning [Public Preview]",
            "date_modified": "2024-11-21T20:41:10.000Z",
            "date_published": "2024-11-20T23:07:40.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">GitHub Apps can be installed on an Enterprise account and granted new Enterprise permissions. These permissions allow the app to manage the enterprise object via REST APIs and GraphQL. This includes the creation of organizations, managing membership via SCIM or invitations, and setting policies on the enterprise.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Supporting Enterprise management by GitHub Apps helps administrators move off of PATs (Classic) and OAuth apps, and supports more reliable and secure automation patterns.</p>",
            "url": "https://github.com/github/roadmap/issues/1045",
            "title": "Enterprise-level access for GitHub Apps and app installation APIs [Public Preview]",
            "date_modified": "2024-11-21T20:41:24.000Z",
            "date_published": "2024-11-20T23:04:26.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">We are expanding our metered billing model to self-serve customers — giving control to admins to convert into a pay-as-you-go model for GitHub Enterprise (GHE) and GitHub Advanced Security (GHAS). This provides a frictionless procurement and billing experience, as well as adding flexibility with pay-as-you-go pricing.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">The self serve model is aimed at giving organizations a flexible option for utilizing GitHub for their specific needs. The addition of pay-as-you-go pricing, only builds on that flexibility by providing even greater adaptability for your specific organizations.</p>",
            "url": "https://github.com/github/roadmap/issues/1044",
            "title": "In-product volume <> metered conversion for self-serve customers [GA]",
            "date_modified": "2024-11-21T20:41:28.000Z",
            "date_published": "2024-11-20T23:01:44.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Copilot Skillsets enable extension builders to expand Copilot's functionality with significantly less development effort than building Agents. By simply specifying APIs for external services and databases, builders can rely on Copilot to handle complex tasks like prompt crafting, LLM completion, function evaluation, and GitHub context gathering. This streamlined approach reduces the workload, making it faster and easier to create Copilot Extensions that deliver context-aware responses.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">Skillsets allow developers to streamline their workflow by accessing real-time information, automating routine tasks, and integrating external tools into Copilot Chat. This increases productivity by allowing for rapid development of extensions that deliver faster, context-aware responses spanning across a company’s various tools and data sources. By simplifying the development for extension builders, Skillsets encourage diverse contributions to the Copilot ecosystem and lower cost of total ownership around building extensions.</p>",
            "url": "https://github.com/github/roadmap/issues/1043",
            "title": "Copilot Extensions - 3P Skillsets for extension builders [Public Preview]",
            "date_modified": "2024-11-21T20:41:41.000Z",
            "date_published": "2024-11-20T22:59:00.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Copilot Workspace gives developers a jumpstart on their coding tasks with an AI-native workflow for brainstorming, planning and implementing code changes using natural language. After Copilot has finished implementing, the developer can validate the result by building, running, or testing code changes directly inside Copilot Workspace using the integrated compute environment. If a build or test fails, Copilot helps move things along by automatically suggesting fixes.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">By adopting the unified Copilot Workspace, development teams can expect a notable boost in productivity and code quality. Developers will be able to efficiently manage complex code changes and track their progress efficiently, reducing manual effort and freeing up time for innovation. Real-time mode will provide developers with the tools to quickly validate and refine AI-generated code, ensuring confidence in the code being shipped. Ultimately, this will lead to faster project completion times, higher-quality code, and a more streamlined development process, meeting the needs of both individual developers and enterprise teams.</p>",
            "url": "https://github.com/github/roadmap/issues/1041",
            "title": "Copilot Workspace in GitHub.com [GA]",
            "date_modified": "2024-11-21T20:41:54.000Z",
            "date_published": "2024-11-20T22:53:07.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        }
    ]
}