{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, code scanning can be set up by adding a GitHub Actions workflow to a repository. We're going to provide a solution to set up code scanning without adding a workflow file.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enabling code scanning without a workflow file will make it easier to start using code scanning and see alerts.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will enable default CodeQL code scanning security analysis without adding a workflow file to the repository.<br>\nIf they want to customize the analysis to specify the frequency of scans, the languages or directories to scan or use specific commands to compile the code, etc., they will need to add a workflow file to a repository and then edit the CodeQL analysis workflow.</p>",
            "url": "https://github.com/github/roadmap/issues/624",
            "title": "Enable code scanning without a workflow file",
            "date_modified": "2022-12-14T18:37:50.000Z",
            "date_published": "2022-12-14T18:36:20.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">SAML single sign-on (SSO) gives organization owners and enterprise owners a way to control and secure access to organization resources like repositories, issues, and pull requests. Organization owners can invite your personal account to join their organization that uses SAML SSO, which allows you to contribute to the organization and retain your existing identity and contributions on GitHub.</p>\n<p dir=\"auto\">When you access resources within an organization that uses SAML SSO, GitHub will redirect you to the organization's SAML IdP to authenticate. After you successfully authenticate with your account on the IdP, the IdP redirects you back to GitHub, where you can access the organization's resources.</p>\n<p dir=\"auto\">The purpose of this feature is to augment existing audit log events with the SAML identity associated with the user who took the relevant action. In doing so, customers using GitHub Enterprise will be able to track activity associated with a specific SAML identity in the enterprise and organization audit logs.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enterprise and Organization owners will be able to track audit log activity associated with specific SAML SSO identities. By providing the SAML SSO identity as part of the audit log, enterprise and organization owners can quickly and easily link logs from multiple sourcing using the same SAML SSO identity identifiers.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">The <code class=\"notranslate\">external_identity_nameid</code> or <code class=\"notranslate\">external_identity_username</code> will be displayed in all audit log events where the SAML SSO identity was used as a means of authentication.</p>",
            "url": "https://github.com/github/roadmap/issues/623",
            "title": "SAML SSO identity displayed in enterprise audit log events - [Beta]",
            "date_modified": "2022-12-14T18:27:23.000Z",
            "date_published": "2022-12-14T18:26:53.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">While fine-grained PATs support GitHub's REST APIs, the public beta does not include GraphQL support.  This roadmap item tracks the ability to use a fine-grained PAT against all the same GraphQL APIs that a GitHub App can target.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Lots of GitHub features are surfaced via the GraphQL API, and we need fine-grained PATs to be able to use them. When complete, fine-grained PATs will have parity with GitHub Apps when it comes to GraphQL.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We'll be confident in the correctness and security of fine-grained PAT access to GraphQL APIs.  You'll be able to use a fine-grained PAT anywhere you could use a user-to-server GitHub app token.</p>",
            "url": "https://github.com/github/roadmap/issues/622",
            "title": "Fine-grained PATs support for GraphQL",
            "date_modified": "2022-12-14T18:27:22.000Z",
            "date_published": "2022-12-14T18:26:50.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub already provides <a href=\"https://education.github.com/teachers\">multiple benefits for verified teachers</a> including:</p>\n<ul dir=\"auto\">\n<li><a href=\"https://classroom.github.com/\">GitHub Classroom</a> for managing assignments</li>\n<li><a href=\"https://github.com/team\">GitHub Team</a> for courses, coding clubs, and nonprofit research</li>\n<li><a href=\"https://github.blog/2022-05-09-prepare-for-next-semester-with-github-global-campus-and-codespaces/\" rel=\"nofollow\">GitHub Codespaces</a> cloud-hosted development environments</li>\n</ul>\n<p dir=\"auto\"><strong>Now, verified teachers can also use <a href=\"https://copilot.github.com\">GitHub Copilot</a> free of charge.</strong> GiHub Copilot is an AI pair programmer that uses <a href=\"https://openai.com/blog/openai-codex/\" rel=\"nofollow\">OpenAI Codex</a> to suggest code and entire functions in real time, right from your editor. Earlier this summer, following a successful year long technical preview with more than 1.2 million developers, <a href=\"https://github.blog/2022-06-21-github-copilot-is-generally-available-to-all-developers/\" rel=\"nofollow\">we launched GitHub Copilot for individuals</a>. The feedback received from the community has made it abundantly clear: AI is one of the best tools to empower the next generation of developers. With GitHub Copilot, developers have more time and space to focus on solving bigger problems and building even better software.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">GitHub Copilot is effective at solving many introductory programming assignments, which may impact how you assess your students. One <a href=\"https://doi.org/10.1145/3511861.3511863\" rel=\"nofollow\">study</a> found that solutions generated by GitHub Copilot placed it amongst the top 25% of students in a cohort.</p>\n<p dir=\"auto\">We recognize that student's use of GitHub Copilot will likely change the way you plan new lessons, and are committed to partnering closely with our teacher community on how GitHub Copilot can support you and your students. By offering GitHub Copilot free of charge to teachers, we hope to make it easier for teachers to understand and anticipate the impact on student assignments. If you’re interested in sharing your experience, feedback, or ideas, please <a href=\"https://github.com/community/Global-Campus-Teachers/discussions/118\">join the conversation</a> with other verified teachers on GitHub Global Campus.</p>\n<p dir=\"auto\">If you're a teacher, but haven't been verified yet, <a href=\"https://education.github.com/discount_requests/teacher_application\">join GitHub Global Campus for teachers.</a></p>",
            "url": "https://github.com/github/roadmap/issues/621",
            "title": "Copilot for Teachers - [GA]",
            "date_modified": "2022-12-14T18:27:20.000Z",
            "date_published": "2022-12-14T18:26:47.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><p dir=\"auto\"><strong>Summary</strong><br>\nActions will add the ability to run your workflow jobs on the latest macOS version from Apple, Ventura.<br>\n<strong>Intended Outcome</strong><br>\nRun your Actions workflow jobs on the latest iteration of Apple's macOS platform.</p>\n<p dir=\"auto\"><strong>How will it work</strong><br>\nUpdate your workflow jobs to include <code class=\"notranslate\">runs-on: macos-13</code></p>\n<div class=\"snippet-clipboard-content notranslate position-relative overflow-auto\" data-snippet-clipboard-copy-content=\"jobs:\n  build:\n    runs-on: macos-13\n    steps:\n      - uses: actions/checkout@v2\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\"><pre class=\"notranslate\"><code class=\"notranslate\">jobs:\n  build:\n    runs-on: macos-13\n    steps:\n      - uses: actions/checkout@v2\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\n</code></pre></div>",
            "url": "https://github.com/github/roadmap/issues/620",
            "title": "Actions: macOS 13 (Ventura) on GitHub-hosted runners (Beta)",
            "date_modified": "2022-12-14T18:27:19.000Z",
            "date_published": "2022-12-14T18:26:44.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">With this ship, the use of a new<code class=\"notranslate\">read:audit_log</code> scope will be required to provide personal access tokens (classic) and OAuth apps with the ability to read audit log events.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Stolen and compromised credentials are the number one cause of data breaches across the industry. To mitigate the risk of compromised credentials, GitHub recommends adhering to the <a href=\"https://en.wikipedia.org/wiki/Principle_of_least_privilege\" rel=\"nofollow\">principle of least privilege</a> which promotes \"giving a user account or process only those privileges which are essential to perform its intended function.\" The new scope will enable access to the audit log endpoints, without requiring full administrative privileges.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Enterprise and organizations administrators can create personal access tokens (classic) and OAuth apps without any change, but will do so with the <code class=\"notranslate\">read:audit_log</code> scope.</p>",
            "url": "https://github.com/github/roadmap/issues/619",
            "title": "Create read:audit_log scope for least privileged access to audit log API",
            "date_modified": "2022-12-14T18:27:17.000Z",
            "date_published": "2022-12-14T18:26:41.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><p dir=\"auto\"><strong>Summary</strong><br>\nEnable groups, corporations, and institutions to fund projects and developers that they depend on</p>\n<p dir=\"auto\"><strong>How will it work?</strong><br>\nAllow an organization to sponsor individuals and organizations via an invoice</p>\n<p dir=\"auto\"><strong>Reasoning</strong><br>\nLarge institutions—companies, enterprises, governments, and more—are the biggest users of open source. They have a clear interest to ensure the projects and developers they depend on not only survive but thrive. Funding open source will help these sponsors to avoid abandonware, keep security tight, and attract technical talent while they’re at it.</p>\n<p dir=\"auto\"><strong>Notes</strong><br>\nThis is the successor to <a href=\"https://github.com/github/roadmap-internal/issues/79\">https://github.com/github/roadmap-internal/issues/79</a></p>",
            "url": "https://github.com/github/roadmap/issues/618",
            "title": "GitHub Sponsors for companies – invoiced billing GA",
            "date_modified": "2022-12-14T18:47:52.000Z",
            "date_published": "2022-11-16T18:41:10.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><p dir=\"auto\"><strong>Summary</strong><br>\nThe GitHub Actions Runner now supports Windows ARM64 architecture.</p>\n<p dir=\"auto\"><strong>Intended Outcome</strong><br>\nPreviously, the Actions runner did not include Windows ARM64 as a supported OS &amp; Arch combination. This new release of the runner enables customers to use their Windows ARM64 environments as self-hosted runners for GitHub Actions.</p>\n<p dir=\"auto\"><strong>How will it work?</strong><br>\nDuring the self-hosted runner creation flow, customers will select the Windows ARM64 release for deployment. For additional information on how to set up a self-hosted Windows ARM64 runner, please refer to our <a href=\"https://docs.github.com/en/actions/hosting-your-own-runners/using-self-hosted-runners-in-a-workflow#using-default-labels-to-route-jobs\">documentation</a>. If you have any feedback or questions for Actions self-hosted Windows ARM support, you can submit an issue in the <a href=\"https://github.com/actions/runner/issues\">runner repository</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/616",
            "title": "Actions: Self-hosted runners now support Windows ARM64",
            "date_modified": "2022-12-14T18:32:32.000Z",
            "date_published": "2022-11-16T18:23:47.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><p dir=\"auto\"><strong>Summary</strong> <br>\nOrganization and Enterprise Admins can now better understand what is driving their GitHub Action use by repo, workflow and Organization. Organization Admins can now interact with information empowering them to answer questions like which repo is using the most minutes, which workflows have changed resulting in more use and how their split of minutes usage compares across different operating systems.</p>\n<p dir=\"auto\"><strong>Intended Outcome</strong><br>\nPreviously, Admins had to look across a range of un-supported data sources extracting information and then still struggled to answer questions like ‘which workflow is driving the most use across all of my runner types’ or ‘which of my repositories are triggering workflow runs and how are those workflows being triggered’. Understanding how the answers to these questions change over time or in comparison to another repository’s usage required even more custom tooling. Enhanced Usage Metrics solves these problems and more.</p>\n<p dir=\"auto\"><strong>How will it work?</strong> <br>\nThe Actions Usage Metrics dashboard is customizable by date range, searchable by repository name, and allows for selecting up to 10 repositories for custom comparison.</p>\n<p dir=\"auto\">Included metrics:<br>\nBillable minutes for all organization repositories<br>\nBillable minutes for all organization workflows<br>\nRepository usage trends by customizable date range<br>\nWorkflow usage trends by customizable date range<br>\nSuccessful workflow runs by invoking event (PR, Push, Merge, etc)<br>\nSuccessful workflow runs by runtime (macos, ubuntu, windows, etc)<br>\nSuccessful workflow runs by runner type (self hosted, hosted, premium)<br>\nSuccessful workflow runs by repository visibility (public or private)</p>",
            "url": "https://github.com/github/roadmap/issues/615",
            "title": "Actions: Enhanced GitHub Actions Usage Metrics and Insights",
            "date_modified": "2022-12-14T18:32:31.000Z",
            "date_published": "2022-11-16T18:23:44.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><p dir=\"auto\"><strong>Summary</strong><br>\nEnterprise customers can now set up Actions to connect with their internal networks in under 10 minutes! GitHub has introduced a turnkey set of tools that allow enterprise admins to give GitHub Actions access to the resources their teams need inside their private networks. This means that teams can now access their internal APIs, Databases, Artifactory instances and more from GitHub’s hosted runners.</p>\n<p dir=\"auto\"><strong>Intended Outcome</strong><br>\nThis enables Actions to connect to Azure services, such as Azure Storage, in a secure manner using service endpoints or to on-premises data sources, taking advantage of user-defined routes. You can also connect Actions to a network virtual appliance to inspect all outbound traffic and take actions according to allow and deny rules. Finally you can configure Actions to use custom DNS and configure network security group (NSG) rules to specify egress traffic restrictions.</p>\n<p dir=\"auto\"><strong>How will it work?</strong><br>\nWith the introduction of GitHub’s secure networking for Actions, customers on Azure can now set up an integration with their <a href=\"https://docs.microsoft.com/en-us/azure/virtual-network/virtual-networks-overview\" rel=\"nofollow\">Azure subscriptions Virtual Networks </a>(VNets). This solution enables service traffic to go through the Azure backbone network, isolating communication from the public Internet and effectively injecting the Actions runner into your private network.</p>",
            "url": "https://github.com/github/roadmap/issues/614",
            "title": "Actions: Private networking support for secure connections to customer VNETs",
            "date_modified": "2022-12-14T18:32:30.000Z",
            "date_published": "2022-11-16T18:23:41.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">In order to help teams migrate over from projects classic, we have a number of areas where we are working towards feature parity. In this quarter, we hope to address the following:</p>\n<ul class=\"contains-task-list\">\n<li class=\"task-list-item\"><input type=\"checkbox\" id=\"\" disabled=\"\" class=\"task-list-item-checkbox\"> Project events are included in issue / pull request timelines</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" id=\"\" disabled=\"\" class=\"task-list-item-checkbox\"> Ability to inherit permissions from a linked repo; improved creation experience from the repo projects index</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" id=\"\" disabled=\"\" class=\"task-list-item-checkbox\"> Activity history for a project</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" id=\"\" disabled=\"\" class=\"task-list-item-checkbox\"> Ability to deep link to an issue within a project</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/613",
            "title": "Projects: Parity with Projects (classic) Milestone 3",
            "date_modified": "2022-12-14T18:32:29.000Z",
            "date_published": "2022-11-16T18:23:38.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">To better protect npm users from supply chain attacks, we are adding support for verifiable links between the source and the built packages in npm packages. You can read more about the proposed approach in the detailed <a href=\"https://github.com/npm/rfcs/pull/626\" data-hovercard-type=\"pull_request\" data-hovercard-url=\"/npm/rfcs/pull/626/hovercard\">RFC</a>.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">npm is the most widely used package manager on the planet today, and is therefore a potential target from malicious actors who want to exploit security weaknesses. By adding verifiable linking between a the source code repository, the build run that generated the package, and the package itself, we can mitigate certain supply chain attacks.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Read more about the proposed approach in the <a href=\"https://github.com/npm/rfcs/pull/626\" data-hovercard-type=\"pull_request\" data-hovercard-url=\"/npm/rfcs/pull/626/hovercard\">RFC</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/612",
            "title": "npm supports creating verifiable links between a package version and its source/build - Public beta",
            "date_modified": "2022-12-14T18:30:37.000Z",
            "date_published": "2022-11-16T18:21:45.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Today, GitHub’s audit log streaming feature requires storage of cloud secrets in GitHub when configuring your stream. Going forward, the audit log feature will support OpenID Connect (OIDC) for streaming partners. OIDC allows for the use of short-lived tokens that are automatically rotated for each configuration.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<ul dir=\"auto\">\n<li>With the new OpenID Connect (OIDC) support, you can stream to one of our five streaming partners</li>\n<li>OpenID token exchange eliminates the need for storing any long-lived cloud secrets in GitHub</li>\n<li>Enterprise owners can use the security mechanisms of their cloud provider to ensure minimal access to cloud resources</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">OIDC will establish an identity layer between GitHub and AWS for the purposes of authenticating GitHub to stream audit log events to a specified AWS S3 bucket. Enterprise owners will establish trust with the GitHub audit log application and assign audit log a role with write permissions to the S3 bucket. When streaming GitHub events via audit log streaming, GitHub will authenticate the cloud role and the Github audit log identity using short lived tokens.</p>",
            "url": "https://github.com/github/roadmap/issues/611",
            "title": "Open ID Connect (OIDC) for GHEC Audit Log Streaming to AWS S3 - [GA]",
            "date_modified": "2022-12-14T18:30:36.000Z",
            "date_published": "2022-11-16T18:21:42.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Audit log streaming enables customers to stream a high-fidelity set of audit log and git event data to a log collection point of their choosing. This capability will sit alongside our existing audit log API and UI. The purpose of this release is to enable Datadog as a streaming endpoint.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">We want enterprise administrators to be able to use the right tools for their job, whether that be short term investigation or longer term threat analysis and prevention. With audit log streaming, customers can be assured that no audit log event will be lost, and that they will be able to satisfy longer term data retention goals by storing streamed events within their own log aggregation systems. Administrators will be able to analyze GitHub audit log data using Datadog's products.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">An enterprise owner will be able to configure a destination domain, port, and token with write authorization to the streaming endpoint.</p>",
            "url": "https://github.com/github/roadmap/issues/610",
            "title": "Audit Log Streaming to Datadog - [GA]",
            "date_modified": "2022-12-14T18:30:35.000Z",
            "date_published": "2022-11-16T18:21:39.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Today by default, only those with the <code class=\"notranslate\">admin</code> role for a repository can view or modify Dependabot alerts. With this change, anyone with <code class=\"notranslate\">write</code> or <code class=\"notranslate\">maintain</code> roles will also have permissions to view and modify Dependabot alerts by default.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Starting February 2023, default permissions for Dependabot alerts are changing so that the right collaborators can see and action on Dependabot alerts.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<ul dir=\"auto\">\n<li>\n<p dir=\"auto\">Based on your repository permissions, if you have <code class=\"notranslate\">write</code> or <code class=\"notranslate\">maintain</code> access, you'll be able to view and action on Dependabot alerts.</p>\n</li>\n<li>\n<p dir=\"auto\">Based on your user notification settings and per-repository watching settings, you'll begin receiving notifications on Dependabot alerts.</p>\n</li>\n</ul>\n<p dir=\"auto\">You can adjust your user notifications settings and per-repository watching settings to make sure you're receiving notifications on Dependabot alerts for the repositories you care about.</p>",
            "url": "https://github.com/github/roadmap/issues/609",
            "title": "Dependabot Alerts default permissions: `write` and `maintain` roles",
            "date_modified": "2022-12-14T18:30:34.000Z",
            "date_published": "2022-11-16T18:21:36.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">A new enterprise membership CSV report enables enterprise administrators to better analyse their membership and take action based on that information. Alongside this, we have also improved the enterprise consumed licenses report to provide more information to administrators.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">With these enhanced reports, customers should be able to more easily answer license consumption and enterprise access questions.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">The Consumed Licenses report is available both in GHEC UI on the enterprise account's <code class=\"notranslate\">settings</code> &gt; <code class=\"notranslate\">enterprise licensing</code> page as a download button for <code class=\"notranslate\">User licenses</code> as well as via API.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/58748846/193249774-09ac320f-f401-429c-9b29-b984cb4aa55f.png\"><img width=\"1425\" alt=\"Screen Shot 2022-09-30 at 6 22 01 AM\" src=\"https://user-images.githubusercontent.com/58748846/193249774-09ac320f-f401-429c-9b29-b984cb4aa55f.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\">The enterprise membership report, it is downloadable via the enterprise account's <code class=\"notranslate\">People</code> page as a download button.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/58748846/193250107-e72fcfe7-a60a-4f2e-ab21-92cd62d352da.png\"><img width=\"1407\" alt=\"Screen Shot 2022-09-30 at 6 24 01 AM\" src=\"https://user-images.githubusercontent.com/58748846/193250107-e72fcfe7-a60a-4f2e-ab21-92cd62d352da.png\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/608",
            "title": "Enterprise Membership & Improved Consumed License Reports",
            "date_modified": "2022-11-29T22:58:19.000Z",
            "date_published": "2022-11-16T18:21:33.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">This feature enables GitHub Enterprise Cloud administrators to move organization move from one enterprise account to another without having to drop the org into a free state or request that GitHub Support transfers the organization for them.</p>\n<p dir=\"auto\">Note this feature enables the transfer of an organization between enterprise accounts only if both enterprise accounts are GHEC Classic accounts - not EMUs - and the administrator is an enterprise owner for both enterprise accounts. A future roadmap item will bring the ability to transfer an organization between GHEC Classic accounts which have different enterprise owners.</p>\n<p dir=\"auto\">Customers wishing to move organizations into a GHEC EMU enterprise are advised to use the <a href=\"https://docs.github.com/en/early-access/enterprise-importer\">GitHub Enterprise Importer</a> to manage this.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers who are growing through acquisitions and partnerships can easily, confidently and quickly transfer organizations into their enterprise cloud account.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">An enterprise administrator with access to two enterprise accounts will:</p>\n<ul dir=\"auto\">\n<li>See a UI option in the enterprise account that is available within the organization's gear drop-down to <code class=\"notranslate\">transfer</code> an organization</li>\n<li>Have the ability to invite an organization from another enterprise account to pull an organization over via the invitation flow</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/607",
            "title": "Transfer Organizations between GHEC Classic Enterprise Accounts",
            "date_modified": "2022-12-14T18:30:33.000Z",
            "date_published": "2022-11-16T18:21:30.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning will include a new tool status page, which will show detailed information about the security tools/engines (including CodeQL) set up on a repository, and will provide information like coverage of files and directories. Users will be able to see errors for analysis and its configuration.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">The code scanning tool status page will help users complete the setup successfully by raising awareness if the setup has failed or is incomplete. It will also allow users to maintain a successful setup by understanding if the success status has changed due to the latest changes in the repository. The tool status page will be a new entry point to debug and configure code scanning tools.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Code scanning will report the status of the tool based on the number of files that were built and analysed. Users will be able to tweak and improve their analysis configuration based on the provided information.</p>",
            "url": "https://github.com/github/roadmap/issues/606",
            "title": "Code scanning tool status page ",
            "date_modified": "2022-12-14T18:30:32.000Z",
            "date_published": "2022-11-16T18:19:29.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">A REST API to enable GitHub Advanced Security, secret scanning, and push protection.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers can use the enterprise level REST API to automate processes around the enablement of secret scanning and push protection.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">With the enterprise REST API, GitHub Advanced Security customers can:</p>\n<ul dir=\"auto\">\n<li>Enable or disable GitHub Advanced Security</li>\n<li>Enable or disable secret scanning</li>\n<li>Enable or disable push protection for secret scanning</li>\n<li>Add or update a custom link to display to contributors who are blocked from pushing a secret</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/605",
            "title": "Secret scanning: Enable at the enterprise level with the Enterprise-level REST API",
            "date_modified": "2022-12-14T18:30:31.000Z",
            "date_published": "2022-11-16T18:19:26.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">In-product metrics on how a specific custom pattern is performing. The metrics can be accessed in the UI page of the specific custom pattern.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">We want to provide customers with insight into how their custom patterns perform. Based on those metrics, admins can take action to enable the custom pattern for push protection, edit the pattern to make it less noisy, or leave the pattern running as is.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When viewing a custom pattern, admins will be able to view metrics about the specific custom pattern. Metrics will include the number of false positives, open alerts, etc.</p>",
            "url": "https://github.com/github/roadmap/issues/604",
            "title": "Secret scanning: Metrics for custom patterns",
            "date_modified": "2022-12-14T18:30:30.000Z",
            "date_published": "2022-11-16T18:19:23.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}