{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Copilot Skillsets enable extension builders to expand Copilot's functionality with significantly less development effort than building Agents. By simply specifying APIs for external services and databases, builders can rely on Copilot to handle complex tasks like prompt crafting, LLM completion, function evaluation, and GitHub context gathering. This streamlined approach reduces the workload, making it faster and easier to create Copilot Extensions that deliver context-aware responses.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">Skillsets allow developers to streamline their workflow by accessing real-time information, automating routine tasks, and integrating external tools into Copilot Chat. This increases productivity by allowing for rapid development of extensions that deliver faster, context-aware responses spanning across a company’s various tools and data sources. By simplifying the development for extension builders, Skillsets encourage diverse contributions to the Copilot ecosystem and lower cost of total ownership around building extensions.</p>",
            "url": "https://github.com/github/roadmap/issues/1043",
            "title": "Copilot Extensions - 3P Skillsets for extension builders [Public Preview]",
            "date_modified": "2024-11-20T22:59:26.000Z",
            "date_published": "2024-11-20T22:59:00.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">The Australia stamp enables local data residency, ensuring compliance with Australian regulations while maintaining secure, seamless access to GitHub's tools and infrastructure.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">With this new stamp, GHEC customers can select Australia as their data residency location, meeting local compliance requirements while enhancing their global reach and infrastructure resilience.</p>",
            "url": "https://github.com/github/roadmap/issues/1042",
            "title": "Proxima Services Fully Functional in the Australia Stamp [GA]",
            "date_modified": "2024-11-20T22:57:10.000Z",
            "date_published": "2024-11-20T22:57:07.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Copilot Workspace gives developers a jumpstart on their coding tasks with an AI-native workflow for brainstorming, planning and implementing code changes using natural language. After Copilot has finished implementing, the developer can validate the result by building, running, or testing code changes directly inside Copilot Workspace using the integrated compute environment. If a build or test fails, Copilot helps move things along by automatically suggesting fixes.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">By adopting the unified Copilot Workspace, development teams can expect a notable boost in productivity and code quality. Developers will be able to efficiently manage complex code changes and track their progress efficiently, reducing manual effort and freeing up time for innovation. Real-time mode will provide developers with the tools to quickly validate and refine AI-generated code, ensuring confidence in the code being shipped. Ultimately, this will lead to faster project completion times, higher-quality code, and a more streamlined development process, meeting the needs of both individual developers and enterprise teams.</p>",
            "url": "https://github.com/github/roadmap/issues/1041",
            "title": "Copilot Workspace in GitHub.com [GA]",
            "date_modified": "2024-11-20T22:53:15.000Z",
            "date_published": "2024-11-20T22:53:07.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">To help you triage and remediate secret leaks more effectively, GitHub secret scanning indicates if a secret detected in your repository has also leaked publicly with a <code class=\"notranslate\">public leak</code> label on the alert. The alert also indicates if the secret was exposed in other repositories across your organization or enterprise with a <code class=\"notranslate\">multi-repo</code> label.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">These labels provide additional understanding into the distribution of an exposed secret, while also making it easier to assess an alert’s risk and urgency. For example, a secret which has a known associated exposure in a public location has a higher likelihood of exploitation. Detection of public leaks is only currently supported for <a href=\"https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/introduction/supported-secret-scanning-patterns#default-patterns\">provider-based patterns</a>.</p>\n<p dir=\"auto\">The <code class=\"notranslate\">multi-repo</code> label makes it easier to de-duplicate alerts and is supported for all secret types, including <a href=\"https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/using-advanced-secret-scanning-and-push-protection-features/custom-patterns/defining-custom-patterns-for-secret-scanning\">custom patterns</a>. You can only view and navigate to other enterprise repositories with duplicate alerts if you have appropriate permissions to view them.</p>",
            "url": "https://github.com/github/roadmap/issues/1040",
            "title": "Secret scanning: `public leak` (high priority) and `multi-repo` (deduping) indicators for alerts [GA]",
            "date_modified": "2024-11-20T22:50:47.000Z",
            "date_published": "2024-11-20T22:50:42.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">We are building GitHub Enterprise Cloud to give you greater control and compliance by allowing you to store your code in your preferred regions, ensuring you meet local regulations. With enhanced user management and unique namespace isolation, we boost your security and governance. Additionally, our integration with GitHub Copilot and secure infrastructure on Microsoft Azure provide you with increased productivity, seamless migration support, and reliable business continuity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">By leveraging these enhancements, you can easily meet regulatory requirements and build trust through secure data residency and management. You'll be empowered to adopt cloud solutions confidently and support your digital transformation with AI tools that boost your development productivity.</p>",
            "url": "https://github.com/github/roadmap/issues/1039",
            "title": "EU Data Residency for GitHub Enterprise [GA]",
            "date_modified": "2024-11-20T22:49:19.000Z",
            "date_published": "2024-11-20T22:46:48.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Organization administrators can enhance their custom organization roles to include repository permissions, which are granted against all of the repositories in the organization. This helps administrators grant the right level of access to teams with cross-cutting responsibilities, like DevOps teams or security managers that are responsible for all of the repositories in the organization.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Administrators can give just the right people the right level of access to all their repositories, and reduce the \"base role\" of repository access for organization members. This overall reduction in privilege helps achieve least privilege goals.</p>",
            "url": "https://github.com/github/roadmap/issues/1038",
            "title": "Custom org roles can include repository permissions [Public Preview]",
            "date_modified": "2024-11-20T22:44:43.000Z",
            "date_published": "2024-11-20T22:42:54.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Enterprise repository properties allows for the management of custom repository properties across your entire enterprise, allowing teams to apply consistent metadata across all of their repos.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">With enterprise repository properties, enterprises have a way to share consistent properties across all of their organization without having to manually synchronize properties and deal with duplication. This gives administrators a common way to describe their repositories, empowering consistent application of rules and search parameters.</p>",
            "url": "https://github.com/github/roadmap/issues/1037",
            "title": "Enterprise Governance: Custom repo properties for enterprise [Public Preview]",
            "date_modified": "2024-11-20T22:41:15.000Z",
            "date_published": "2024-11-20T22:40:48.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">The Issues experience is evolving to include a range of highly requested enhancements including sub-issues, issue types, advanced search for issues, and increased item limits in Projects.</p>\n<p dir=\"auto\"><strong>Sub-issues</strong> introduce a hierarchical structure to GitHub Issues, allowing users to create, discuss, and manage issues more effectively. This addresses a common request from both large and small customers and is one of our top priorities to resolve enterprise-level challenges.</p>\n<p dir=\"auto\"><strong>Issue types</strong> allow users to classify and manage issues with a shared and consistent language across all repositories in an organization. Users can customize their issue types and use them consistently for tracking and reporting, such as bugs, tasks, or features.</p>\n<p dir=\"auto\"><strong>Issues advanced search</strong> allows users to build advanced queries using the AND and OR keywords, as well as nested queries using parentheses. This allows users to understand their issues in a more complex way and find exactly what they're looking for and unlock more advanced reporting.</p>\n<p dir=\"auto\"><strong>Increased item limits in Projects</strong> mean that you can now have 50k items in a project, compared to the previous limit of 1,200 items.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/user-attachments/assets/71ace455-cca0-4610-bee8-fab85ce0f8fe\"><img src=\"https://github.com/user-attachments/assets/71ace455-cca0-4610-bee8-fab85ce0f8fe\" alt=\"Example project using sub-issues and issue types\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/user-attachments/assets/e00bceb0-ede6-448a-bdf2-6e339dfe72d5\"><img src=\"https://github.com/user-attachments/assets/e00bceb0-ede6-448a-bdf2-6e339dfe72d5\" alt=\"Advanced search for issues\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">This is a large improvement to the current Issues experience. Together, these additions make it easier than ever to break down and nest issues, organize your work with a shared language, visualize and understand progress of how work is progressing, and categorize and find just the right issue in GitHub.</p>",
            "url": "https://github.com/github/roadmap/issues/1036",
            "title": "Evolving GitHub Issues [GA]",
            "date_modified": "2024-11-20T22:38:56.000Z",
            "date_published": "2024-11-20T22:38:48.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">All Enterprise-level features, current and future, support the fine-grained permissions model, for both user roles and GitHub App installations. The result is that enterprise administrators can delegate their work safely to other users in their enterprise or GitHub Apps for automation.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Each feature area's settings UI, REST APIs, and GraphQL interfaces has been assigned one or more permissions that the user or app must have in order to access it. These permissions are chosen to support a least privilege model of access, letting you grant access to just what's required to get the job done but not granting more than is required.</p>",
            "url": "https://github.com/github/roadmap/issues/1035",
            "title": "ERP: Enterprise Roles and Permissions [GA]",
            "date_modified": "2024-11-20T22:34:44.000Z",
            "date_published": "2024-11-20T22:34:41.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Allowing customers to self-provision Proxima will open new markets, enable faster customer base growth, and address a key gap in the current process—offering a solution for trials. This shift to self-service will provide customers with more flexibility to manage their enterprise accounts and data residency locations independently, driving broader adoption and increasing accessibility.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">We aim to make minimal adjustments to the current self-serve process, incorporating data residency options into the existing flow. The outcome is that customers will be able to self-provision their accounts in data residency locations and access a trial period, providing them with a seamless, flexible experience that supports faster adoption and broader use of Proxima.</p>",
            "url": "https://github.com/github/roadmap/issues/1034",
            "title": "Proxima Available for Self-Service Customers [GA]",
            "date_modified": "2024-11-20T22:36:38.000Z",
            "date_published": "2024-11-20T22:33:20.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Live Migrations is part of the larger initiative to reduce downtime during feature version upgrades. Time consuming database migrations will be run before the upgrade instead of during the upgrade. As a result, downtime during upgrades will be reduced.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Customers on supported versions will be able to use the live migrations orchestrator to slash off downtime by about 30% to 40%.  We hope this will help further motivate GHES customers to upgrade on a regular cadence, take advantage of new versions, and help reduce the maintenance burden of unsupported versions.</p>",
            "url": "https://github.com/github/roadmap/issues/1033",
            "title": "GHES Live Migration Orchestrator - Reduced Downtime [GA]",
            "date_modified": "2024-11-20T22:32:51.000Z",
            "date_published": "2024-11-20T22:30:22.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">The Copilot Extensibility platform allows developers to build and use extensions across any JetBrains IDE. By enabling extension builders to integrate with Copilot Chat on JetBrains, developers can easily access company knowledge and insights in natural language, no matter where they work.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With Copilot Extensibility on JetBrains, development teams can customize Copilot’s capabilities within a familiar ecosystem. Extensions provide a consistent experience across platforms, enabling developers to find answers and complete tasks without leaving their JetBrains IDE. By using both first- and third-party extensions, teams can tailor Copilot to fit their workflow, minimizing context switching and saving time on research.</p>",
            "url": "https://github.com/github/roadmap/issues/1032",
            "title": "Extensibility in JetBrains Copilot Chat [Public Preview]",
            "date_modified": "2024-11-20T22:29:20.000Z",
            "date_published": "2024-11-20T22:28:25.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">With the new billing platform, Team plan customers can:</p>\n<ul dir=\"auto\">\n<li>Estimate spending: Understand where your (annual, monthly, etc.) spending is trending based on the usage across budgets.</li>\n<li>Gather insights and data: Generate usage reports to share with your team or stakeholders, and know if you're on track with your budget.</li>\n<li>Prevent overspending: Use budgets and alerts to track and control your spending.</li>\n<li>Observe and understand spending: Understand how your spending changes over time and across which products.</li>\n</ul>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">The enhanced billing platform is a suite of new features designed to help administrators understand and manage GitHub spend for their organization. Benefits of the new platform include:</p>\n<ul dir=\"auto\">\n<li><strong>Spend transparency</strong> - view usage for organizations, repositories, products, cost centers, and SKUs by hour, day, month, or year</li>\n<li><strong>Improved control</strong> - set budgets to limit spending and configure alerts to stay informed of budget utilization</li>\n</ul>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/user-attachments/assets/dedad527-2bbe-482d-aeb4-374d3e3f4c16\"><img src=\"https://github.com/user-attachments/assets/dedad527-2bbe-482d-aeb4-374d3e3f4c16\" alt=\"Image\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/1031",
            "title": "Team plan on Billing vNext [GA]",
            "date_modified": "2024-11-20T22:22:17.000Z",
            "date_published": "2024-11-20T22:21:26.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Enterprise repository policies, allows enterprise and organizations administrators to control key repository lifecycle events. This allows for targeting of policy to manage repository creations, deletions, transfers, visibility changes and names either for all repositories or more granularly with custom property targeting.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">By using enterprise repository policies enterprises and organizations can enforce guardrails to ensure new repos can be created meeting their organizational standards and ensure existing repositories are prevented from making accidental changes. This ensures your private repositories are not made accidentally public or deleted, keeping your repositories more secure.</p>",
            "url": "https://github.com/github/roadmap/issues/1030",
            "title": "Enterprise Governance: Repository policy rules [Public Preview]",
            "date_modified": "2024-11-20T22:19:52.000Z",
            "date_published": "2024-11-20T22:18:45.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">The Actions cache now supports the ability to increase your cache size over the per repository limit in a pay as you go model. Previously the Actions Cache was capped at 10 GiB per repository. Now you have the ability to go over that limit and use more storage space. This additional storage is billed in a pay as you go meter, utilizing the existing Actions Storage Meter.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">The increased cache size allows you to make your workflows faster and more efficient. You can also create and use caches for dependencies and other commonly reused files. With a pay as you go model, you are no longer limited in the caching you can do for each workflow run.</p>",
            "url": "https://github.com/github/roadmap/issues/1029",
            "title": "Increased Cache Size in Actions [GA]",
            "date_modified": "2024-11-20T22:07:06.000Z",
            "date_published": "2024-11-20T22:06:08.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">GitHub Actions is adding a new set of hosted runners that will be optimized for storage, memory, high performance, and larger machines. These new machine types allow you to ‘optimize’ your CI/CD pipelines with runners that exactly match your needs whether that is unblocking workloads through more cores or specific machine features.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Using specialty runners allows you to optimize your workflows for cost savings as well as performance. By using the correct runner for the job, you will be able to complete the job faster and more efficiently. These runners also allow jobs that were previously blocked due to machine restrictions to run on a machine that is specialty suited for that particular job, such as jobs that ran out of memory, or storage space on the machine.</p>",
            "url": "https://github.com/github/roadmap/issues/1028",
            "title": "Specialty Runners for GitHub Actions [Public Preview]",
            "date_modified": "2024-11-20T22:01:58.000Z",
            "date_published": "2024-11-20T22:01:17.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Custom models for GitHub Copilot allow organizations to leverage their own repository and telemetry data to train a fine-tuned model for code completion requests. By utilizing their specific data, these custom models provide more relevant and contextually accurate code suggestions tailored to the unique needs of each organization. This personalized approach enhances the suggestion acceptance rate and significantly boosts developer productivity.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With the general availability of custom models, organizations can expect a notable increase in developer productivity due to more precise code suggestions that align with their specific coding practices and contexts. Administrators will gain valuable insights into model usage and quality, enabling them to make informed decisions about model deployment and optimization. Additionally, the ability to create and manage multiple custom models per organization ensures flexibility and scalability, supporting diverse development needs across various teams.</p>",
            "url": "https://github.com/github/roadmap/issues/1027",
            "title": "GitHub Copilot Custom Models [GA]",
            "date_modified": "2024-11-20T21:57:49.000Z",
            "date_published": "2024-11-20T21:56:29.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Copilot Content Exclusions now empower enterprise admins to manage and enforce content exclusions across the entire enterprise. This feature extends beyond the previous capabilities limited to org and repo admins, providing a centralized and comprehensive approach to managing content exclusions. By allowing enterprise-wide exclusions, this feature ensures a consistent and secure environment for all users within the organization.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With the implementation of enterprise-level Copilot Content Exclusions, organizations can expect enhanced control over their codebase and content management policies. Enterprise admins will experience streamlined policy enforcement, reducing the administrative burden on org and repo admins. This centralization of content exclusion rules will lead to a more secure and compliant development environment, ensuring that sensitive or restricted content is consistently excluded across all repositories and users within the enterprise.</p>",
            "url": "https://github.com/github/roadmap/issues/1026",
            "title": "Content Exclusion - IDEs [GA]",
            "date_modified": "2024-11-20T21:48:18.000Z",
            "date_published": "2024-11-20T21:47:28.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">While using open source software (OSS) brings well-demonstrated benefits like leveraging community innovation and empowering developers to focus on differentiated value, it also introduces risks, from security vulnerabilities to targeted attacks. GitHub has powerful features like Dependabot for managing vulnerable versions of your OSS dependencies. Now, OSS License Compliance extends these capabilities, so customers can ensure that the licenses of the OSS packages they depend on are compliant with a policy defined by their organization.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">With GitHub OSS License Compliance, organizations configure a baseline policy that describes which licenses its upstream dependencies are allowed/disallowed to have - we'll provide starter policies that should suit most users, with the ability to customize them. Once configured, the business risk of incorporating dependencies with incompatible licenses is reduced in three key ways:</p>\n<ol dir=\"auto\">\n<li>Rulesets will enforce the policy on incoming PRs, ensuring that changes entering your codebase don't introduce new dependencies with incompatible licenses.</li>\n<li>GitHub Actions that build artifacts have a complete view of the build environment and composition of the resulting artifact, so they can prevent deep transitive dependencies with problematic licenses from being included. Conversely, an artifact whose dependencies consist of only packages with compliant licenses will receive a secure, verifiable attestation to that effect.</li>\n<li>Existing code may have latent, undiscovered problems with licenses, so we provide a scanning feature to introspect the Software Bill of Materials (SBOMs) of your repositories and find dependencies with noncompliant licenses.</li>\n</ol>\n<p dir=\"auto\">When these workflows detect problems, they'll generate alerts and metrics similar to the existing Dependabot alerts to provide context, auditability, and actionable outcomes.</p>\n<p dir=\"auto\">With GitHub OSS License Compliance, you'll have a comprehensive way to understand and manage the risk inherent in using open source, so you can focus on the benefits.</p>",
            "url": "https://github.com/github/roadmap/issues/1025",
            "title": "Open Source License Compliance [GA]",
            "date_modified": "2024-11-20T21:46:29.000Z",
            "date_published": "2024-11-20T21:42:31.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Enterprises are able to share Github Apps in a secure, private manner amongst their organizations. Instead of making one app public and sharing it among many orgs, or creating a new private app in each org, enterprise administrators can create a single app in their enterprise and make it available to just their orgs and enterprise members.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Enterprise administrators can create and manage GitHub Apps from the Enterprise settings page. Organization administrators can install these apps in their organizations. In the future, at GA, we'll support transferring apps to the enterprise and support silent updates of app permissions.</p>",
            "url": "https://github.com/github/roadmap/issues/1024",
            "title": "Enterprise-owned GitHub Apps [Public Preview]",
            "date_modified": "2024-11-20T21:36:36.000Z",
            "date_published": "2024-11-20T21:35:54.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        }
    ]
}