{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects written with using new C# 11 language features.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\">CodeQL supports builds and standard language features up to C# 10</a>. C# 11 is due to be released before EOY 2022. Updating CodeQL support will allow customers who want to adopt C# 11 to benefit from CodeQL's comprehensive security analysis, while using C#11 latest features.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains C# 11 code, or if C# has been <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/configuring-code-scanning#changing-the-languages-that-are-analyzed\">configured as a language to be analyzed</a> in the <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/configuring-code-scanning#about-code-scanning-configuration\">code scanning workflow</a>, CodeQL will pick up code using C# 11 language features automatically. No further configuration changes are needed. As soon as the analysis is finished, the CodeQL results will then become visible to you in the \"Security\" tab and on pull requests. C# 11 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/663",
            "title": "CodeQL Support for C# 11 language features",
            "date_modified": "2023-02-22T18:12:30.000Z",
            "date_published": "2023-02-22T18:11:26.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning will allow users to filter alerts by language, in order for individual developers to be able to focus on the code they know (and care about) most.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">The code scanning language filter will help users to sort and manage alerts efficiently by focusing on a specific language. It will also support users to review all language-specific alerts faster after enabling analysis for a new language.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to filter alerts by language on the code scanning page on the 'Security' tab at the repository level. Filtering will work based on file extension, which means it will work for all code scanning tools, including CodeQL.</p>",
            "url": "https://github.com/github/roadmap/issues/662",
            "title": "Code scanning: Filter alerts by language",
            "date_modified": "2023-02-22T18:12:28.000Z",
            "date_published": "2023-02-22T18:11:23.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning will allow users to filter alerts by file path, in order for individual developers and security teams to be able to focus on the part of the code they know (and care about) most.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">The code scanning file path filter will help users to sort and manage alerts efficiently by focusing on a specific part of the code related to the project. It will also enable users who work on big repositories (like monorepos) to review all alerts specific to the part of the code they are responsible for.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to filter alerts by file path on the code scanning page on the 'Security' tab at the repository level. Filtering will work based on file path and extension, which means it will work for all code scanning tools, including the CodeQL engine.</p>",
            "url": "https://github.com/github/roadmap/issues/661",
            "title": "Code scanning: Filter alerts by file path",
            "date_modified": "2023-02-22T18:12:26.000Z",
            "date_published": "2023-02-22T18:11:20.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GHES Management Console authentication is currently based on a single admin password. For many customers this is a security risk since this password is shared and there is no way of having an audit trail about which user made changes to the system.</p>\n<p dir=\"auto\">We are therefore introducing a multi-user concept with a user management interface to the Management Console which will allow administrators to invite new users with different types of roles.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Allow GHES administrators to create separate logins for each user that needs access to the Management Console in GHES.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">GHES administrators can create and manage users that have access to the Management Console from within the Management Console itself. Please note that these users are specific to the Management Console and are not system users, so the <code class=\"notranslate\">admin</code> account will continue to be the only account that can be used to ssh into the appliance.</p>\n<p dir=\"auto\">Here's a <a href=\"https://github.rewatch.com/video/87d92ifwaxdr6ig9-multi-user-authentication-for-management-console-demo\" rel=\"nofollow\">demo in ReWatch</a> of the feature.</p>",
            "url": "https://github.com/github/roadmap/issues/660",
            "title": "Multi-user authentication for GHES Management Console - [GA]",
            "date_modified": "2023-02-22T18:12:24.000Z",
            "date_published": "2023-02-22T18:11:17.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">In order to provide users with a consistent sorting experience across all layouts in Projects, the ability to sort board views by field values will be supported. This will allow users to further customize and tailor their views by reordering their items in a way that is most helpful to them.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Supporting the ability to sort work items on a project will allow users to automatically order their items, removing the need to manually reorder work items in board columns and lessening confusion about default sorting order.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to specify the field they would like to sort their project items by from the view configuration menu, alongside other project customizations.</p>",
            "url": "https://github.com/github/roadmap/issues/659",
            "title": "Projects: Sorting on board layout",
            "date_modified": "2023-02-22T18:12:21.000Z",
            "date_published": "2023-02-22T18:11:14.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Users will be able to create a Roadmap view to visualize issues and their relationships across a timespan and track a body of work towards a deadline.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Providing users with a Roadmap layout will allow them to plan and track their work over time and towards a deadline. It gives users a visual component to understand the timing and progress of their initiatives and communicate with stakeholders.</p>\n<p dir=\"auto\">In addition to the table and board layout types, a roadmap layout will provide users with a visual at-a-glance view of their work items.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When creating a new project or project view, a user will be able to select a Roadmap layout alongside the table and board layouts. This will populate their work items along a time-based axis, driven by date or iteration fields within the project. They can customize their roadmap view by grouping, sorting, and filtering their work items, as well as selecting a zoom level depending on the granularity they would like to see.</p>\n<p dir=\"auto\">More details can be found in the <a href=\"https://docs.github.com/en/issues/planning-and-tracking-with-projects/customizing-views-in-your-project/customizing-the-roadmap-layout\">documentation</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/658",
            "title": "Projects: Roadmap Layout [GA] ",
            "date_modified": "2023-02-22T18:12:19.000Z",
            "date_published": "2023-02-22T18:11:11.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Today it's hard to know where a npm package came from - what's the source code and how was the package built? Maintainers can optionally specify this information, but it's easy for malicious folks to spoof.</p>\n<p dir=\"auto\">Provenance creates verifiable links back to the source code and build instructions for public npm packages. This gives users of these packages a way to verify the package does what it says. This is a new security capability for package managers, in collaboration with the Sigstore open source project, and it is debuting on npm.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">To increase confidence of supply chain security in the npm ecosystem.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Provenance starts when you build your npm package in a cloud CI/CD provider, like GitHub Actions.</p>\n<p dir=\"auto\">While the build is running, we request an OIDC token from GitHub Actions, which is a signed JWT that includes information about the organization, repository, commit, branch, workflow... all the metadata associated with the build. That signed JWT is sent to Sigstore's public servers, where they verify it came from GitHub, issue a signing certificate to the build with the build metadata stored in X.509 extension OIDs, and record the information on a public ledger.</p>\n<p dir=\"auto\">When the build publishes to npm, it uses a special flag (<code class=\"notranslate\">npm publish --provenance</code>) that includes the Sigstore signing certificate along with the built package. The npm registry records this information and displays it to users via the website and API.</p>",
            "url": "https://github.com/github/roadmap/issues/657",
            "title": "npm package provenance - GA",
            "date_modified": "2023-02-22T18:06:28.000Z",
            "date_published": "2023-02-22T18:05:22.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">For many of our security features (e.g., Dependabot alerts, secret scanning, code scanning), you can enable the feature for all repositories in an organization or for one repository at a time. We intend to provide a solution for organizations to easily filter their repositories on security overview's security coverage page and enable security features for the filtered set of  repositories all with a few clicks.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enabling and configuring security features on multiple repositories will make it easier to quickly roll out security features across an entire organization.</p>",
            "url": "https://github.com/github/roadmap/issues/656",
            "title": "Bulk-enable security features for multiple repositories",
            "date_modified": "2023-02-22T18:06:26.000Z",
            "date_published": "2023-02-22T18:05:19.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Today, organizations can see only the current status of security alerts and security feature enablement for their repositories.  It's not possible to get a historical view.  We intend to provide trends graphs at the organization level for both security feature enablement and security alerts.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Trend graphs will enable organizations to analyze their security program's performance and gauge overall changes in their security posture.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We will offer two new pages in security overview: security coverage trends and risk trends that will house trends graphs for the following security features:</p>\n<ul dir=\"auto\">\n<li>Dependabot alerts</li>\n<li>Code scanning alerts</li>\n<li>Secret scanning alerts</li>\n<li>Push protection <em>(enablement trends graph only)</em></li>\n<li>GitHub Advanced Security <em>(enablement trends graph only)</em></li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/655",
            "title": "View a trend of security feature enablement/security alerts",
            "date_modified": "2023-02-22T18:06:24.000Z",
            "date_published": "2023-02-22T18:05:16.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently developers use the <a href=\"https://docs.github.com/en/actions/deployment/targeting-different-environments/using-environments-for-deployment#environment-protection-rules\">environment protection rules</a> to require specific conditions to pass before a deployment job referencing the environment can proceed.</p>\n<p dir=\"auto\">We are now enabling repository administrators to bypass all the protection rules on a given environment (break glass) by default and force the pending jobs referencing the environment to proceed.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Previously, deployments (jobs) gated on the protection rules defined on an environment had to wait until all the configured protection rules passed.</p>\n<p dir=\"auto\">This new feature provides the ncessary granular control for administrators to allow/disallow bypassing the protection rules on specific environments.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">During a workflow run executing multiple deployment Jobs referencing environments, Admins can now choose the specific environments where they would like to bypass the protection rules and force deployments.</p>\n<p dir=\"auto\">We allow admins to bypass protection rules and manually force deployments by default. Alternatively, Environments can also be configured in advance to disallow the bypass feature and enforce the protection rules for all deployments to the environment.</p>",
            "url": "https://github.com/github/roadmap/issues/654",
            "title": "Actions - Granular control for admins to bypass protection rules on an environment (break glass) - [GA] ",
            "date_modified": "2023-02-22T18:06:22.000Z",
            "date_published": "2023-02-22T18:05:13.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub Actions can power continuous deployment (CD) workflows directly in your GitHub repositories. We are providing a new management experience to view and track your deployments using GitHub Actions across various environments. Developers and DevOps managers can now view the full history of deployments in a repository or filter them across environments &amp; workflows to understand their status or address any blockers.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Previously you can <a href=\"https://docs.github.com/en/actions/deployment/managing-your-deployments/viewing-deployment-history\">view current and past deployments</a> by clicking on Environments on the homepage of your repository.</p>\n<p dir=\"auto\">With the new dashboard views, developers can easily trace their deployments to their source workflows powered by GitHub Actions or any external tool to:</p>\n<ul dir=\"auto\">\n<li>understand who initiated a deployment or what is going on in a given environment of a repository or</li>\n<li>view status and duration of the latest deployment on a given environment or</li>\n<li>view logs to diagnose any issues failing their deployments or</li>\n<li>drill deep into each deployment job details to review any pending approvals or other metadata around deployments</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">With the new deployment dashboard views, you can now get a unified filterable view of all the deployment history in your repository which can be pivoted by environments and the specific workflows that deployed to them. This will allow developers and DevOps managers to track their deployments and manage their release process better.</p>",
            "url": "https://github.com/github/roadmap/issues/653",
            "title": "Actions: New dashboard view for deployments across environments",
            "date_modified": "2023-02-22T18:06:20.000Z",
            "date_published": "2023-02-22T18:05:10.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Users in organizations will be allowed to create GitHub Project templates that others in their organization can use when creating new projects.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206555-cd0d4031-00dc-4ae9-a744-179d58be2e4c.png\"><img src=\"https://user-images.githubusercontent.com/1295166/214206555-cd0d4031-00dc-4ae9-a744-179d58be2e4c.png\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enterprise clients tell us they want to be able to share 'Projects' practices amongst their 'teams.' We aim to demonstrate to our enterprise customers that they will be supporting more features that enable them to plan and track at scale. And essentially add discoverability for projects that organizations wish others to emulate.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<h2 dir=\"auto\">User stories</h2>\n<ul dir=\"auto\">\n<li>As a user who is a member of an org AND an admin of a GitHub Project, for the project where I am an admin inside of an org where I am a member, I can make a project available as a template or make a project unavailable as a template</li>\n<li>As a user who is a member of an org AND has templates that have been enabled for an organization, I can use one of those templates when creating a new project</li>\n<li>As a user who is a member of an org and has at least read access to a project that is a template, when I view that project, the UI communicates to me that it is a template</li>\n</ul>\n<h2 dir=\"auto\">Design</h2>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206554-21e16353-d17b-4625-9b03-98d2696861a6.png\"><img width=\"1440\" alt=\"A 4\" src=\"https://user-images.githubusercontent.com/1295166/214206554-21e16353-d17b-4625-9b03-98d2696861a6.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206555-cd0d4031-00dc-4ae9-a744-179d58be2e4c.png\"><img width=\"1440\" alt=\"A 6\" src=\"https://user-images.githubusercontent.com/1295166/214206555-cd0d4031-00dc-4ae9-a744-179d58be2e4c.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206556-73ea921c-bedf-420b-8de0-d0fa2a1341b2.png\"><img width=\"1440\" alt=\"A 7\" src=\"https://user-images.githubusercontent.com/1295166/214206556-73ea921c-bedf-420b-8de0-d0fa2a1341b2.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206559-4acb9bfa-bd1f-4bb3-88bc-889fd7e9bb70.png\"><img width=\"1440\" alt=\"B 3\" src=\"https://user-images.githubusercontent.com/1295166/214206559-4acb9bfa-bd1f-4bb3-88bc-889fd7e9bb70.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206561-5227a338-9cb3-4281-96ba-ab073a7bc845.png\"><img width=\"1440\" alt=\"B 4\" src=\"https://user-images.githubusercontent.com/1295166/214206561-5227a338-9cb3-4281-96ba-ab073a7bc845.png\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/1295166/214206565-b11d9983-9179-4ad6-ac1a-2ab16bdfed6b.png\"><img width=\"1440\" alt=\"C 1\" src=\"https://user-images.githubusercontent.com/1295166/214206565-b11d9983-9179-4ad6-ac1a-2ab16bdfed6b.png\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/652",
            "title": "Projects: Org templates ",
            "date_modified": "2023-02-22T18:06:18.000Z",
            "date_published": "2023-02-22T18:05:07.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Existing customers who opt to upgrade to GHEC (from Free and Teams) will get an enterprise account as part of the upgrade experience.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">We are bringing enterprise accounts to all of our enterprise customers.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">During the upgrade flow, the customer will be prompted to name their enterprise and once they complete the upgrade purchase, they will land inside their newly minted enterprise account alongside their originating organization.</p>",
            "url": "https://github.com/github/roadmap/issues/651",
            "title": "Enterprise Upgrades include Enterprise Accounts",
            "date_modified": "2023-02-22T18:06:16.000Z",
            "date_published": "2023-02-22T18:05:04.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Updating multiple Issues, Drafts and PRs in the table view can be tedious and click heavy. We intend to provide a way for users to edit multiple items at once, as well as, reverse the change in the event of a mistake.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Users find it intuitive, efficient and goof proof to edit multiple items in the table view.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Select a set of cell in the table and drag to update the value within those cells.</p>",
            "url": "https://github.com/github/roadmap/issues/650",
            "title": "Projects: Bulk edit items in table layout",
            "date_modified": "2023-02-22T18:06:15.000Z",
            "date_published": "2023-02-22T18:05:01.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, grouping multi-select fields in Projects does not create a distinct group for each value if multiple values are selected for the same row. We have heard from users that this is not the expected or desired behaviour. We intend to update group by for multi-select values so that each value creates a distinct group.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">If a user creates a table view grouped by assignee and multiple assignees are assigned to an issue, a group will be created for each set of assignees.</p>\n<p dir=\"auto\">For example if Tom is assigned to 6 issues, and Mary is assigned to 6 issues and they are both assigned to 4 issues three groups will appear in the table - one for Tom with 6 issues, one for Mary with 6 issues and one for Tom and Mary with 4 issues. This is confusing because both Tom and Mary want to be able to see all 10 issues assigned to each of them.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We intend to update this behaviour so that when a user groups by a multi-select field in the table view a distinct group will appear for each value. Using the example from above - only two groups appear, one for Tom with 10 issues and one for Mary with 10 issues.</p>",
            "url": "https://github.com/github/roadmap/issues/649",
            "title": "Projects: Improve Group By for multi-select fields",
            "date_modified": "2023-02-22T18:06:13.000Z",
            "date_published": "2023-02-22T18:04:58.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub previously release the ability to <a href=\"https://github.com/github/roadmap-internal/issues/705\">display IP addresses in Enterprise's audit logs</a>. This release will extend the display of IP address metadata to Organization's audit logs. By including IP addresses in the audit log event payloads,  customers will be equipped with a more robust set of data on which to perform security investigations, build threat detection models and demonstrate compliance with company and industry regulatory requirements.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enterprise customers must be equipped with data to meet auditing, compliance and security objectives. We want enterprise administrators to have access to the data they need for the job they need to do, whether that be a compliance matter, short term security investigation or longer-term threat analysis and prevention. Displaying IP addresses in the audit log is a key piece of data for customers to develop increased understanding of user behavior to meet their compliance and security needs.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Actor's IP address will be displayed for audit log event meeting the following criteria:</p>\n<ul dir=\"auto\">\n<li>all organization-related events</li>\n<li>all events pertaining to organization-owned projects and other assets where the actor is a member of the organization.</li>\n<li>all events pertaining to organization-owned private and internal repos where the actor is a member of the organization.</li>\n</ul>\n<p dir=\"auto\">IP address disclosure will be an opt-in feature.</p>",
            "url": "https://github.com/github/roadmap/issues/648",
            "title": "IP address metadata in Organization's audit logs [GA]",
            "date_modified": "2023-02-22T18:06:11.000Z",
            "date_published": "2023-02-22T18:04:55.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">With Enterprise Server version 3.9, customers will be able to track Management Console activity in the GHES audit log.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Security teams can monitor the activity taken by any user in the Management Console, and have confidence that all of the GHES appliance is covered by their monitoring and security best practice processes.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Administrators and security teams will be able to access the Management Console event logs in the same way that they access other audit log events from the GitHub Enterprise Server appliance:</p>\n<ol dir=\"auto\">\n<li>Enterprise Settings - The <code class=\"notranslate\">Audit log</code> page of Enterprise Settings (<code class=\"notranslate\">/enterprises/github/settings/audit-log</code>)</li>\n<li>Site admin - The <code class=\"notranslate\">Audit log</code> page of Site admin (<code class=\"notranslate\">/stafftools/audit_log</code>)</li>\n<li>Log streaming and forwarding - If you have either of these set up, the Management Console logs will be included with your other audit data.</li>\n</ol>\n<p dir=\"auto\">Here's an example in <code class=\"notranslate\">Site admin</code> of the log message that's generated when a user logs out of the Management Console:</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/6233292/219059011-0ebbf6ce-ff9b-4352-85f4-c0714347283b.png\"><img src=\"https://user-images.githubusercontent.com/6233292/219059011-0ebbf6ce-ff9b-4352-85f4-c0714347283b.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/647",
            "title": "Logs from GitHub Enterprise Server's Management Console in the Audit Log",
            "date_modified": "2023-02-22T18:06:09.000Z",
            "date_published": "2023-02-22T18:04:52.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, many of the tools provided by the Management Console in GitHub Enterprise Server are only accessible via the UI or via command line tools (after SSHing into the appliance). We are building out a suite of APIs, starting with the <code class=\"notranslate\">Replication API</code>. This will expose a new <code class=\"notranslate\">replication status</code> endpoint for our High Availability (HA) product.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">If you use the GitHub Enterprise Server High Availability environment you will be able to retrieve the replication status of a given node by calling an API endpoint.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We will create a new RESTful endpoint that you can call to get the replication status to a particular HA node.</p>",
            "url": "https://github.com/github/roadmap/issues/646",
            "title": "New Replication API for the High Availability setup of GitHub Enterprise Server",
            "date_modified": "2023-02-22T18:06:07.000Z",
            "date_published": "2023-02-22T18:04:49.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">When a GHES administrator backs up their appliance, or restores their appliance using a backup, GHES does not curretnly show how the backup or restore operation is progressing. We are going to update our tooling so that customers can see how these operations are progressing.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">GHES administrators understand how far through a backup or restore operation they are.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We will add details to our backup and restore tools that will allow us to track how a backup or restore operation is progress. We will then use these details to add a progress bar to the command line interfaces for the backup and restore tools.</p>",
            "url": "https://github.com/github/roadmap/issues/645",
            "title": "Show backup and restore progress to GHES customers",
            "date_modified": "2023-02-22T18:01:11.000Z",
            "date_published": "2023-02-22T18:00:17.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Repository rules are the evolution of GitHub's current branch protection rules, which will allow you to operate repository protections at scale with confidence and clarity.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/7575792/215554335-5581432f-ea8f-418e-8766-bd3725b31f62.png\"><img src=\"https://user-images.githubusercontent.com/7575792/215554335-5581432f-ea8f-418e-8766-bd3725b31f62.png\" alt=\"GitHubScreenShot-Google Chrome-30-01-2023-000541\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Intended outcome</h3>\n<p dir=\"auto\">This is a new way to manage rules with a new user experience allowing for the flexible targeting of branches, rule visibility for all repository members, and for GitHub Enterprise customers, the ability to create and enforce rules at an organization level.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<h4 dir=\"auto\">Repository rulesets</h4>\n<ul dir=\"auto\">\n<li>All repository members can read all active rulesets on a repository.</li>\n<li>Repositories support multiple rulesets.</li>\n<li>Rulesets can be layered, allowing for multiple branches to have rules applied from different rulesets.\n<ul dir=\"auto\">\n<li>E.g., one ruleset for the <code class=\"notranslate\">main</code> branch requires 2 pull request reviewers, and one ruleset for <code class=\"notranslate\">all branches</code> requires status checks. In this case, <code class=\"notranslate\">main</code> would require status checks <em>and</em> 2 pull request reviewers.</li>\n</ul>\n</li>\n<li>Repository admins and authorized users can create a repository ruleset, which includes the following activities:\n<ul dir=\"auto\">\n<li><strong>General:</strong> Name the ruleset, activate or disable the ruleset, configure who can bypass the ruleset's rules, or delete the ruleset.</li>\n<li><strong>Targeting:</strong> Select the branch(es) where rules apply. Choose from <code class=\"notranslate\">all</code> branches, the <code class=\"notranslate\">default</code> branch, or use wildcard matches. You can also exclude branches from matching.</li>\n<li><strong>Rules:</strong> Configure existing branch protections.</li>\n</ul>\n</li>\n</ul>\n<h4 dir=\"auto\">GitHub Enterprise</h4>\n<p dir=\"auto\">GitHub Enterprise accounts will have the following additional capabilities:</p>\n<ul dir=\"auto\">\n<li>Create and enforce rulesets at the organization level for all or select repositories based on pattern matching of repository names.</li>\n<li>Apply new rules:\n<ul dir=\"auto\">\n<li>Commit messages: Prevent commits to a branch based on commit message requirements.</li>\n<li>Branch and tag names: Ensure branches and tags meet naming conventions.</li>\n<li>File restrictions: Limit commits to a branch based on requirements for a file's name, path, and size.</li>\n</ul>\n</li>\n<li>Set a ruleset to Evaluation mode, which allows \"dry-runs\" of rulesets to understand their effect before they are enforced.</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/644",
            "title": "Repository Rules ",
            "date_modified": "2023-02-22T18:01:09.000Z",
            "date_published": "2023-02-22T18:00:14.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}