{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Custom models for GitHub Copilot allow organizations to leverage their own repository and telemetry data to train a fine-tuned model for code completion requests. By utilizing their specific data, these custom models provide more relevant and contextually accurate code suggestions tailored to the unique needs of each organization. This personalized approach enhances the suggestion acceptance rate and significantly boosts developer productivity.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With the general availability of custom models, organizations can expect a notable increase in developer productivity due to more precise code suggestions that align with their specific coding practices and contexts. Administrators will gain valuable insights into model usage and quality, enabling them to make informed decisions about model deployment and optimization. Additionally, the ability to create and manage multiple custom models per organization ensures flexibility and scalability, supporting diverse development needs across various teams.</p>",
            "url": "https://github.com/github/roadmap/issues/1027",
            "title": "GitHub Copilot Custom Models [GA]",
            "date_modified": "2024-11-20T21:57:49.000Z",
            "date_published": "2024-11-20T21:56:29.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Copilot Content Exclusions now empower enterprise admins to manage and enforce content exclusions across the entire enterprise. This feature extends beyond the previous capabilities limited to org and repo admins, providing a centralized and comprehensive approach to managing content exclusions. By allowing enterprise-wide exclusions, this feature ensures a consistent and secure environment for all users within the organization.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With the implementation of enterprise-level Copilot Content Exclusions, organizations can expect enhanced control over their codebase and content management policies. Enterprise admins will experience streamlined policy enforcement, reducing the administrative burden on org and repo admins. This centralization of content exclusion rules will lead to a more secure and compliant development environment, ensuring that sensitive or restricted content is consistently excluded across all repositories and users within the enterprise.</p>",
            "url": "https://github.com/github/roadmap/issues/1026",
            "title": "Content Exclusion - IDEs [GA]",
            "date_modified": "2024-11-20T21:48:18.000Z",
            "date_published": "2024-11-20T21:47:28.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">While using open source software (OSS) brings well-demonstrated benefits like leveraging community innovation and empowering developers to focus on differentiated value, it also introduces risks, from security vulnerabilities to targeted attacks. GitHub has powerful features like Dependabot for managing vulnerable versions of your OSS dependencies. Now, OSS License Compliance extends these capabilities, so customers can ensure that the licenses of the OSS packages they depend on are compliant with a policy defined by their organization.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">With GitHub OSS License Compliance, organizations configure a baseline policy that describes which licenses its upstream dependencies are allowed/disallowed to have - we'll provide starter policies that should suit most users, with the ability to customize them. Once configured, the business risk of incorporating dependencies with incompatible licenses is reduced in three key ways:</p>\n<ol dir=\"auto\">\n<li>Rulesets will enforce the policy on incoming PRs, ensuring that changes entering your codebase don't introduce new dependencies with incompatible licenses.</li>\n<li>GitHub Actions that build artifacts have a complete view of the build environment and composition of the resulting artifact, so they can prevent deep transitive dependencies with problematic licenses from being included. Conversely, an artifact whose dependencies consist of only packages with compliant licenses will receive a secure, verifiable attestation to that effect.</li>\n<li>Existing code may have latent, undiscovered problems with licenses, so we provide a scanning feature to introspect the Software Bill of Materials (SBOMs) of your repositories and find dependencies with noncompliant licenses.</li>\n</ol>\n<p dir=\"auto\">When these workflows detect problems, they'll generate alerts and metrics similar to the existing Dependabot alerts to provide context, auditability, and actionable outcomes.</p>\n<p dir=\"auto\">With GitHub OSS License Compliance, you'll have a comprehensive way to understand and manage the risk inherent in using open source, so you can focus on the benefits.</p>",
            "url": "https://github.com/github/roadmap/issues/1025",
            "title": "Open Source License Compliance [GA]",
            "date_modified": "2024-11-20T21:46:29.000Z",
            "date_published": "2024-11-20T21:42:31.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Enterprises are able to share Github Apps in a secure, private manner amongst their organizations. Instead of making one app public and sharing it among many orgs, or creating a new private app in each org, enterprise administrators can create a single app in their enterprise and make it available to just their orgs and enterprise members.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Enterprise administrators can create and manage GitHub Apps from the Enterprise settings page. Organization administrators can install these apps in their organizations. In the future, at GA, we'll support transferring apps to the enterprise and support silent updates of app permissions.</p>",
            "url": "https://github.com/github/roadmap/issues/1024",
            "title": "Enterprise-owned GitHub Apps [Public Preview]",
            "date_modified": "2024-11-20T21:36:36.000Z",
            "date_published": "2024-11-20T21:35:54.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">To enhance reliability and reduce the potential for downtime, we’re improving how configuration changes are applied in GitHub Enterprise Server. By optimizing the conditional execution of <code class=\"notranslate\">ghe-config-apply</code>, we aim to ensure a smoother, more resilient experience for users managing their appliance configurations.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Config Apply is the most used appliance tool, as any configuration change requires running the command. This improvement will help reduce the time Config apply takes to successfully run, improve maintainability and stability.</p>",
            "url": "https://github.com/github/roadmap/issues/1023",
            "title": "Light-weight Config apply [GA]",
            "date_modified": "2024-11-20T21:34:37.000Z",
            "date_published": "2024-11-20T21:33:54.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Proposition</h3>\n<p dir=\"auto\">Copilot Code Review leverages AI to provide developers with fast, actionable feedback on their code, including one-click fixes powered by Copilot Autofix. This feature addresses the common pain point of long waits for code reviews that slow down software development and frustrate developers. By offering immediate AI-driven insights, Copilot Code Review helps developers move toward \"ready to merge\" status more quickly, even before a human review is completed. This innovative approach enhances productivity and accelerates the development process, positioning GitHub ahead of other AI code review tools in the market.</p>\n<h3 dir=\"auto\">Customer Outcome</h3>\n<p dir=\"auto\">With Copilot Code Review, development teams can expect to significantly reduce the time spent waiting for code reviews, leading to faster cycle times and increased developer satisfaction. Developers will receive valuable, high-quality feedback on a regular basis, ensuring code quality and efficiency. Additionally, as adoption grows, teams using Copilot Enterprise can expect more comprehensive reviews with custom coding guidelines, further enhancing the overall development workflow.</p>",
            "url": "https://github.com/github/roadmap/issues/1022",
            "title": "Copilot Code Reviews [GA]",
            "date_modified": "2024-11-20T21:30:52.000Z",
            "date_published": "2024-11-20T21:28:33.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Issues advanced search allows users to build advanced queries using the <code class=\"notranslate\">AND</code> and <code class=\"notranslate\">OR</code> keywords, as well as nested queries using parentheses. This allows users to understand their issues in a more complex way and find exactly what they're looking for and unlock more advanced reporting.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/user-attachments/assets/73e42815-1994-4b8f-b766-f8ef306d0ded\"><img src=\"https://github.com/user-attachments/assets/73e42815-1994-4b8f-b766-f8ef306d0ded\" alt=\"Image\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">This is a large improvement to the existing search experience for Issues, allowing users to build and share complex queries and views. It unlocks the ability to understand questions such as \"What are all of the open bugs or tasks that are either assigned to me, <em>or</em> have a particular set of labels?\"</p>",
            "url": "https://github.com/github/roadmap/issues/1021",
            "title": "Issues advanced search [GA]",
            "date_modified": "2024-11-20T21:27:29.000Z",
            "date_published": "2024-11-20T21:25:58.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Issue types allow users to classify and manage issues with a shared and consistent language across all repositories in an organization. Users can customize their issue types and use them consistently for tracking and reporting, such as bugs, tasks, or features.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/user-attachments/assets/5faebbbc-a1f9-422d-9c6f-82f429408676\"><img src=\"https://github.com/user-attachments/assets/5faebbbc-a1f9-422d-9c6f-82f429408676\" alt=\"issue types\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Issue types allow users to easily see how their work breaks down and rolls up, understand the progress of a bug backlog, find all of the high level initiatives teams are working on, create custom views in Projects to understand the breakdown and complexity of their work, and even set up automated workflows.</p>",
            "url": "https://github.com/github/roadmap/issues/1020",
            "title": "Issue Types [GA]",
            "date_modified": "2024-11-20T21:24:09.000Z",
            "date_published": "2024-11-20T21:23:27.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">GitHub's image customization allows developers to use their existing workflow YAML to produce VM images which can be used as the base for their different developer environments. Developers can use the new syntax to take the state of their current environment and save that to an image to be used in future workflows.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">Custom Images allows developers to gain control over their supply chain and reduce the average duration of their workflows by customizing the software, tools, and files on Actions Hosted runners before a workflow starts. 33% of Actions runs are to set up tools on their machine before they even start to download packages that their application is dependent on. This takes time on every run of that workflow. With custom images developers can now customize those pre-installed tools, saving time by creating a \"pre-warmed\" machine.</p>",
            "url": "https://github.com/github/roadmap/issues/1019",
            "title": "Custom Images [Public Preview]",
            "date_modified": "2024-11-20T21:21:44.000Z",
            "date_published": "2024-11-20T21:20:32.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">This release is our quarterly update to GitHub Enterprise Server. With it, will come a host of improvements that are tagged with the label \"GHES 3.17\" on our public roadmap.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">In every quarterly GHES release, we add a host of capabilities aimed at improving the overall experience for all different types of GitHub Enterprise Server users. Please check back during Q2 2025 for a better understanding of what will be scoped into this release.</p>",
            "url": "https://github.com/github/roadmap/issues/1018",
            "title": "GHES 3.17 [GA]",
            "date_modified": "2024-11-20T21:18:13.000Z",
            "date_published": "2024-11-20T21:17:36.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">This release is our quarterly update to GitHub Enterprise Server. With it, will come a host of improvements that are tagged with the label \"GHES 3.16\" on our public roadmap.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">In every quarterly GHES release, we add a host of capabilities aimed at improving the overall experience for all different types of GitHub Enterprise Server users. Please check back in Q1 2025 for a better understanding of what will be scoped into this release.</p>",
            "url": "https://github.com/github/roadmap/issues/1017",
            "title": "GHES 3.16 [GA]",
            "date_modified": "2024-11-20T21:15:04.000Z",
            "date_published": "2024-11-20T21:13:59.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/134638657?u=796627b7b5613a75768e410a1ef8cd04cea589d7&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">This release is our quarterly update to GitHub Enterprise Server. With it, will come a host of improvements that are tagged with the label \"GHES 3.15\" on our public roadmap.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">In every quarterly GHES release, we add a host of capabilities aimed at improving the overall experience for all different types of GitHub Enterprise Server usersIn version 3.15, operators will benefit from updated minimum server specifications, reducing issues caused by under-provisioned instances. Additionally, the code security configuration experience will be introduced, streamlining the deployment of GitHub security products at scale.</p>",
            "url": "https://github.com/github/roadmap/issues/1015",
            "title": "GHES 3.15 [GA]",
            "date_modified": "2024-11-20T20:46:52.000Z",
            "date_published": "2024-11-20T20:45:40.000Z",
            "author": {
                "name": "glider-bot",
                "url": "https://github.com/glider-bot"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Enterprise administrators will be able to assign an organization role (custom or pre-defined) to an enterprise team against multiple organizations at once. Organization administrators will be unable to remove or bypass this assignment, ensuring that critical teams have the access they require.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">If it is easier to manage access to multiple organizations at the same time, administrators should be able to divide their estate into multiple organizations. This in turn helps with delegation and separation of concerns without losing the ability to collaborate across the organizations.</p>",
            "url": "https://github.com/github/roadmap/issues/994",
            "title": "Assign organization roles to a team across multiple organizations - [Public Preview]",
            "date_modified": "2024-11-20T20:30:19.000Z",
            "date_published": "2024-07-25T18:44:49.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub Enterprise Importer (GEI) currently imposes the following repository size limits:</p>\n<ul dir=\"auto\">\n<li>10 GB size limit for a Git repository: This limit only applies to the source code. To check if the repository archive is over the limit, use the <a href=\"https://github.com/github/git-sizer\">git-sizer</a> tool and review the total blob size in the output.</li>\n<li>10 GB limit for metadata: The Importer cannot migrate repositories with more than 10 GB of metadata. Metadata includes issues, pull requests, releases, and attachments.</li>\n</ul>\n<p dir=\"auto\">To support the migration of larger repositories to GitHub and between GitHub products, we will be increasing the repository size limits to:</p>\n<ul dir=\"auto\">\n<li>40 GB size limit for a Git repository</li>\n<li>40 GB limit for metadata</li>\n</ul>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers will be capable of migrating larger repositories using GEI. In doing so, GitHub migration tooling is expanding to help customers operating large monorepos migrate to GitHub or between GitHub products.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">This ship will not change how GEI is used. Customers can continue using GEI using the same instructions documented in our <a href=\"https://docs.github.com/en/migrations/using-github-enterprise-importer/understanding-github-enterprise-importer/about-github-enterprise-importer\">documentation on GitHub Enterprise Importer</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/993",
            "title": "Increase GitHub Enterprise Importer's (GEI) repository size limit to 40GB (Preview)",
            "date_modified": "2024-11-20T18:56:00.000Z",
            "date_published": "2024-07-25T18:44:46.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We're enhancing user experience and data accessibility with new CSV export functionality on the security overview dashboard and secret scanning metrics page at the organization level. This functionality will enable you to easily download detailed data on alerts from the overview dashboard and data regarding secrets blocked by push protection on the secret scanning metrics page.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This feature empowers you with the tools to perform offline analysis of alerts and and secrets blocked by push protection. By exporting this data to a CSV file, you will gain the ability to:</p>\n<ul dir=\"auto\">\n<li>conduct in-depth offline analysis</li>\n<li>compare and integrate data with external systems</li>\n<li>archive data for compliance and historical analysis</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">You'll find an \"Export to CSV\" button on both the security overview dashboard and the secret scanning metrics page. Clicking this button will automatically download the underlying data that backs the report, which will reflect the filters currently applied to the respective pages. Downloads are permitted only for repositories where you have the appropriate <a href=\"https://docs.github.com/enterprise-cloud@latest/code-security/security-overview/about-security-overview#permission-to-view-data-in-security-overview\">permission</a>.</p>\n<p dir=\"auto\">Looking forward, we plan to expand this functionality to include API access, enabling automated data retrieval.</p>",
            "url": "https://github.com/github/roadmap/issues/989",
            "title": "Export organization-level code security alerts and push protection data to to CSV",
            "date_modified": "2024-11-18T22:14:50.000Z",
            "date_published": "2024-06-26T21:12:27.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub <a href=\"https://docs.github.com/en/actions/deployment/targeting-different-environments/using-environments-for-deployment\">Environments</a> are typically used with Actions workflows to describe a general deployment target like production, testing, staging, or development to which an application or service (s) is deployed to. Currently we support “deployment protection rules” which can be configured to protect environments and their associated secrets &amp; variables from getting accessed by unintended deployments.  And also to have more controlled deployment rollouts based on certain predefined criteria evaluated by each of the rules.</p>\n<p dir=\"auto\">However, Developers and DevOps managers often need to centrally configure and manage protection rules on their environments across their teams and applications beyond the GitHub boundaries of organizations and repositories.</p>\n<p dir=\"auto\">To enable \"Management of Environments at Scale\",  we are coming up with a new delightful configuration experience for defining and managing groups of Environments across repositories coupled with powerful settings management across Environments.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">With this new cross-repo management experience for Environments, Developers and DevOps managers would be enabled to</p>\n<ul dir=\"auto\">\n<li>group environments within/across repos by adding metadata to environments across repositories in your organization.</li>\n<li>easily and consistently apply protection rules on groups of environments across repositories in order to have a standard set of configurations and settings across all environments within the group.</li>\n<li>filter deployment views by groups of Environments.</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We are enabling a new central management experience for Environments across repositories by</p>\n<ul dir=\"auto\">\n<li>Extending <a href=\"https://docs.github.com/en/repositories/configuring-branches-and-merges-in-your-repository/managing-rulesets/about-rulesets\">rulesets</a> to support central configurations on “protected Environments”</li>\n<li>Supporting <a href=\"https://docs.github.com/en/organizations/managing-organization-settings/managing-custom-properties-for-repositories-in-your-organization\">custom properties</a> to group Environments and configure rulesets</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/988",
            "title": "Actions: Managing Environments at Scale",
            "date_modified": "2024-11-20T17:12:28.000Z",
            "date_published": "2024-06-26T21:10:26.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">macOS 15 is now available in public beta for GitHub-hosted runners.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Apple developers require the latest version of macOS and Xcode now have access to newer versions</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Update the <code class=\"notranslate\">runs-on:</code> key in you workflow file to <code class=\"notranslate\">macos-15</code>, <code class=\"notranslate\">macos-15-large</code>, or <code class=\"notranslate\">macos-15-xlarge</code></p>\n<div class=\"snippet-clipboard-content notranslate position-relative overflow-auto\" data-snippet-clipboard-copy-content=\"jobs:\n  build:\n    runs-on: macos-15\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\"><pre class=\"notranslate\"><code class=\"notranslate\">jobs:\n  build:\n    runs-on: macos-15\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\n</code></pre></div>",
            "url": "https://github.com/github/roadmap/issues/987",
            "title": "Actions: macOS 15 is now available for GitHub-hosted runners (Preview)",
            "date_modified": "2024-11-13T17:29:34.000Z",
            "date_published": "2024-06-26T21:10:23.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">macOS 15 is now generally available for GitHub-hosted runners. It will also become the <code class=\"notranslate\">latest</code> macOS runner image with workflows migrating from November 2024 through December 2024.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Apple developers require the latest version of macOS and Xcode now have access to newer versions</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Actions workflows using the <code class=\"notranslate\">macos-latest</code> label will incrementally transition from macOS 14 to macOS 15 beginning November 2024 and will conclude before the end of December 2024. This also applies to larger macOS runners, for which the following YAML workflow labels can be used:</p>\n<ul dir=\"auto\">\n<li><code class=\"notranslate\">macos-latest-xlarge</code></li>\n<li><code class=\"notranslate\">macos-latest-large</code></li>\n</ul>\n<div class=\"snippet-clipboard-content notranslate position-relative overflow-auto\" data-snippet-clipboard-copy-content=\"jobs:\n  build:\n    runs-on: macos-latest\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\"><pre class=\"notranslate\"><code class=\"notranslate\">jobs:\n  build:\n    runs-on: macos-latest\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\n</code></pre></div>\n<p dir=\"auto\">To use macOS 15 directly, update the <code class=\"notranslate\">runs-on:</code> key in you workflow file to <code class=\"notranslate\">macos-15</code>, <code class=\"notranslate\">macos-15-large</code>, or <code class=\"notranslate\">macos-15-xlarge</code></p>\n<div class=\"snippet-clipboard-content notranslate position-relative overflow-auto\" data-snippet-clipboard-copy-content=\"jobs:\n  build:\n    runs-on: macos-14\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\"><pre class=\"notranslate\"><code class=\"notranslate\">jobs:\n  build:\n    runs-on: macos-14\n    steps:\n      - uses: actions/checkout@v4\n      - name: Build\n        run: swift build\n      - name: Run tests\n        run: swift test\n</code></pre></div>",
            "url": "https://github.com/github/roadmap/issues/986",
            "title": "Actions: macOS 15 is now available for GitHub-hosted runners (GA)",
            "date_modified": "2024-11-20T18:59:10.000Z",
            "date_published": "2024-06-26T21:10:20.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Our larger macOS runners have been upgraded to include M2 Pro Mac Minis, which will provide Apple developers with an improved performance to build and test iOS apps. With these new runner options, developers can be confident that their apps will be compatible with past, present, and future software requirements, while also increasing their development velocity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">GitHub Actions makes it easy for developers to build and deploy their applications using the latest Apple technologies. With GitHub Actions, developers can seamlessly integrate their workflows and take advantage of the latest Apple technologies to build and deploy their applications with ease.</p>",
            "url": "https://github.com/github/roadmap/issues/985",
            "title": "M2 Pro Powered GitHub hosted runners [Public Preview]",
            "date_modified": "2024-11-20T20:18:13.000Z",
            "date_published": "2024-06-26T21:10:17.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Value Prop</h3>\n<p dir=\"auto\">Our larger macOS runners have been upgraded to include M2 Pro Mac Minis, which will provide Apple developers with an improved performance to build and test iOS apps. With these new runner options, developers can be confident that their apps will be compatible with past, present, and future software requirements, while also increasing their development velocity.</p>\n<h3 dir=\"auto\">Expected Outcome</h3>\n<p dir=\"auto\">GitHub Actions makes it easy for developers to build and deploy their applications using the latest Apple technologies. With GitHub Actions, developers can seamlessly integrate their workflows and take advantage of the latest Apple technologies to build and deploy their applications with ease.</p>",
            "url": "https://github.com/github/roadmap/issues/984",
            "title": "M2 Pro Powered GitHub hosted runners [Public Preview]",
            "date_modified": "2024-11-20T21:12:37.000Z",
            "date_published": "2024-06-26T21:10:14.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}