{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are providing users with the ability to set column limits on the board layout, based off of the number of items in a specific board column. These can be set per column, and are unique to each board layout.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By setting and visually highlighting limits on the number of items in a column on a board, users and teams will be able to prioritize their work through the different stages of development. This will increase focus and clarity on the most important work items.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to set a per-column limit for the number of work items in a board column that is unique to each board. The count of items and column limit will be surfaced at the top of a board column in a pill (ex: <code class=\"notranslate\">4/8</code>), and it will be visually highlighted when the limit is reached to indicate to a user that they have reached the limit. Users will not be restricted to moving new items to a column, so it acts as a \"soft\" limit.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498133-f3d38a46-3f04-4eea-9df9-316b2141be93.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498133-f3d38a46-3f04-4eea-9df9-316b2141be93.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498481-05f77806-ceb5-48f9-aa44-9f1e1d312d5a.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498481-05f77806-ceb5-48f9-aa44-9f1e1d312d5a.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/885",
            "title": "Projects: Board column limits",
            "date_modified": "2023-12-20T19:02:16.000Z",
            "date_published": "2023-12-20T19:00:58.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are providing users with the ability to specify a field as a swimlane on their boards, allowing them to view their items in a horizontal grouping to visually separate and distinguish between work that belongs to different workstreams, team members, or priorities.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By providing users with the ability to specify a field as a swimlane on their boards, we can help them with tasks such as</p>\n<ul dir=\"auto\">\n<li>Viewing high priority items alongside items with lower priority, to help draw attention to the most important work and what requires immediate attention</li>\n<li>Viewing different work streams side-by-side to view the progress of the work for ongoing projects and across teams in a single view</li>\n<li>Viewing items across team members to see how work breaks down within the team and how it is progressing together</li>\n</ul>\n<p dir=\"auto\">This swimlane view gives users a single zoomed out or stacked view that allows them to stay in one place, without losing the context of how this work compares to each other and is progressing together.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to specify a field as a swimlane that is unique to each board. The swimlanes act as a horizontal grouping on board layouts, and items will be able to be moved between swimlanes to make adjustments and update the field value.</p>",
            "url": "https://github.com/github/roadmap/issues/884",
            "title": "Projects: Board swimlanes",
            "date_modified": "2023-12-20T19:02:13.000Z",
            "date_published": "2023-12-20T19:00:55.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Users will be able to select a <code class=\"notranslate\">Slice by</code> field that pulls all field values into a panel on the left side, with the project items associated with those values in the view on the right side. Clicking through the values in the panel will filter and adjust the items that appear in the view, allowing users to quickly page through their items and make adjustments.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/101840513/252498137-d9c71624-054e-4e38-9da5-af6cff01f9ff.png\"><img src=\"https://user-images.githubusercontent.com/101840513/252498137-d9c71624-054e-4e38-9da5-af6cff01f9ff.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">By providing users with the ability to create this view on their projects, we can help them accomplish tasks such as</p>\n<ul dir=\"auto\">\n<li>Visually separating and breaking down epics from the individual tasks by the <code class=\"notranslate\">Tracked by</code> field, giving a hierarchical view of your items powered by <a href=\"https://docs.github.com/en/issues/tracking-your-work-with-issues/about-tasklists\">tasklists</a> to understand how larger work items are progressing in a single view</li>\n<li>Planning out current and upcoming iterations by the <code class=\"notranslate\">Iteration</code> field, allowing users to quickly make adjustments to when work will begin if plans change</li>\n<li>Understanding team capacity with by the <code class=\"notranslate\">Assignee</code> field, breaking down work items by each distinct assignee and giving an easy canvas to move items between team members to reassign work</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to specify a <code class=\"notranslate\">Slice by</code> field on any of their table, board, or roadmap layouts. The panel allows a user to select a value from the list that populates and filters the work items that appear in the view on the right.</p>",
            "url": "https://github.com/github/roadmap/issues/883",
            "title": "Projects: Configure a `Slice by` field",
            "date_modified": "2023-12-20T19:02:10.000Z",
            "date_published": "2023-12-20T19:00:52.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Dependabot version updates creates updates to proactively update out-of-date dependencies. It currently creates one pull request per dependency, but that doesn't make sense for every repository. This feature will allow maintainers to configure their updates to group certain sets of dependencies together.</p>\n<p dir=\"auto\">This is a continuation from the public beta: <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"785401555\" data-permission-text=\"Title is private\" data-url=\"https://github.com/github/roadmap/issues/148\" data-hovercard-type=\"issue\" data-hovercard-url=\"/github/roadmap/issues/148/hovercard\" href=\"https://github.com/github/roadmap/issues/148\">#148</a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This will help developers better manage the many PRs that Dependabot opens.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Once the developer specifies grouping rules in their <code class=\"notranslate\">dependabot.yml</code> file, they will start seeing Dependabot open PRs with multiple dependencies based on those rules.</p>",
            "url": "https://github.com/github/roadmap/issues/874",
            "title": "Dependabot Grouped Version Updates GA",
            "date_modified": "2023-12-20T19:01:43.000Z",
            "date_published": "2023-12-20T19:00:25.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The audit log API endpoint will impose a rate limit of 15 queries per minute per enterprise or org starting August 1st, 2023. To prepare for this change, Enterprises and Organizations currently exceeding this limit should ensure individuals, applications and integrations querying the audit log API:</p>\n<ul dir=\"auto\">\n<li>Query at a maximum frequency of 15 queries per minute, and/or;</li>\n<li>Honor HTTP 429 and HTTP 403 responses, as outline in our documentation for <a href=\"https://docs.github.com/en/rest/overview/resources-in-the-rest-api?apiVersion=2022-11-28#rate-limiting\">rate limits for requests from personal accounts</a> and <a href=\"https://docs.github.com/en/apps/creating-github-apps/registering-a-github-app/rate-limits-for-github-apps\">rate limits for GitHub Apps</a></li>\n</ul>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">A high-quality audit log is an essential tool used by enterprises to ensure compliance, maintain security, investigate issues, and promote accountability. To support these objectives, the audit log API needs to be highly reliable, consistently available, and extremely scalable. The new rate limit safeguards the audit log APIs availability and scalability by providing back pressure to individuals, applications, or integrations querying the audit log APIs.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When the 15 query per minute rate limit is exceeded, the audit log API will return either a HTTP 429 or HTTP 403 response indicating that a rate limit has been reached. When these responses are received, the querying entity should wait at least 4 seconds before attempting to query the audit log API again.</p>",
            "url": "https://github.com/github/roadmap/issues/872",
            "title": "New rate limit for the audit log API endpoints",
            "date_modified": "2023-12-20T19:01:37.000Z",
            "date_published": "2023-12-20T19:00:19.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning default setup can now be enabled on repositories which don't contain any CodeQL supported languages and will automatically update to include any supported languages when they are added to the repository.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">You can enable default setup on any repository and have confidence that it will automatically give the best possible protection when the repository changes to include CodeQL supported languages.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When default setup is enabled on a repository without any CodeQL supported languages, the repository will watch for CodeQL supported languages that added to the repository and automatically update to analyse them.</p>",
            "url": "https://github.com/github/roadmap/issues/854",
            "title": "Code scanning default setup can be enabled on repositories before code in supported languages are added to the repositories",
            "date_modified": "2023-12-20T18:21:25.000Z",
            "date_published": "2023-12-20T18:20:38.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning default setup will be available for self-hosted runners on GHEC.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers with self-hosted runners on GHEC can use code scanning default setup on their repositories.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Code scanning default setup will use self-hosted runners on GHEC if a repository has access to self-hosted runners with the label <code class=\"notranslate\">code-scanning</code>. Default setup will only use one runner type per repository, either hosted or self-hosted.</p>",
            "url": "https://github.com/github/roadmap/issues/852",
            "title": "Code scanning default setup supports self-hosted runners on GHEC",
            "date_modified": "2023-12-20T18:21:23.000Z",
            "date_published": "2023-12-20T18:20:32.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The preflight checks from backup-utils v.312.0 onwards will better support customers using our cluster topology. These checks will improve the performance of backup-utils by performing the following checks:</p>\n<ol dir=\"auto\">\n<li>Verify that all remote file systems are <strong>not</strong> read-only, and highlight the nodes that are not writable.</li>\n<li>Log an error message from <code class=\"notranslate\">ghe-cluster-host-check</code> for each cluster node that is offline, so that customers know which nodes to fix before starting to generate a backup.</li>\n<li>On High Availability setups, backup-utils will now write the temporary <code class=\"notranslate\">.sync_in_progress</code> lock file (which should pause network maintenance globally) to both the primary and replica nodes during backups.</li>\n</ol>",
            "url": "https://github.com/github/roadmap/issues/851",
            "title": "Harden backup-utils for Cluster",
            "date_modified": "2023-12-20T18:21:21.000Z",
            "date_published": "2023-12-20T18:20:29.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We're creating a new command line tool to show when all of the background jobs associated with an upgrade to a GitHub Enterprise Server instance have been completed. This will allow customers who are chaining multiple feature upgrades together (e.g. upgrading from GitHub Enterprise Server 3.13 to 3.14, and then immediately from 3.14 to 3.15) to start their next upgrade as soon as possible, rather than waiting 24 hours as we currently recommend.</p>",
            "url": "https://github.com/github/roadmap/issues/850",
            "title": "GHES upgrade complete indicator",
            "date_modified": "2023-12-20T18:21:20.000Z",
            "date_published": "2023-12-20T18:20:26.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, code scanning CodeQL can scan code in a repository when there is a push to the default or any protected branch. Alternatively, it can also scan code on schedule depending on the setup configuration. If there are any alerts detected on the main or default branches outside of a pull request, code scanning will detect them.</p>\n<p dir=\"auto\">Code scanning will provide AI-generated fixes for CodeQL alerts that are present on such branches, outside the pull request experience. These fixes help developers to resolve alerts quickly and reduce the number of vulnerabilities in codebases.</p>\n<p dir=\"auto\">All GHAS customers on GitHub will have access to this functionality.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Users can fix existing security vulnerabilities on the main or default branches faster with the help of code scanning AI-generated autofixes. It helps reduce the number of active vulnerabilities and improves the security posture more quickly. Additionally, the UX will allow users to jump into an editing environment for developers to make any adjustments to the proposed fix.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Following the CodeQL analysis, an LLM will provide a fix for alerts where possible. These AI-generated remediation suggestions are then posted as a code scanning autofix for an alert.</p>",
            "url": "https://github.com/github/roadmap/issues/848",
            "title": "Code scanning: AI-powered autofixes for CodeQL alerts that exist on default and other branches (outside the PR experience)",
            "date_modified": "2023-12-20T18:19:22.000Z",
            "date_published": "2023-12-20T18:18:38.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning allows for configuring a alert level that will make the check run fail and trigger pull request merge protection functionality in the organisation settings. It will provide better integration with <a href=\"https://docs.github.com/en/repositories/configuring-branches-and-merges-in-your-repository/managing-rulesets\">repository rulesets</a>. It will also help customers configure and roll out CodeQL as a required check before a PR can be merged. The functionality will also be available via API.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Users can configure the level of code scanning alert to fail the check run on PR at the organisation level. Additionally, users will be able to use API.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When using the <code class=\"notranslate\">Repository rulesets</code> in organization or repository settings, users can easily navigate to the settings page to select the severity of code scanning alert that will cause code scanning check runs to fail, thus preventing the PR merge. The same can be done through the  API.</p>",
            "url": "https://github.com/github/roadmap/issues/847",
            "title": "Code scanning: Improve experience for code scanning PR merge protection functionality for Rulesets",
            "date_modified": "2023-12-20T18:19:21.000Z",
            "date_published": "2023-12-20T18:18:34.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">On February 1, 2024, we will deprecate the Copilot Chat API endpoints currently being routed through <a href=\"https://copilot-proxy.githubusercontent.com/\" rel=\"nofollow\">https://copilot-proxy.githubusercontent.com/</a>. Instead, these requests will go through <a href=\"https://api.githubcopilot.com/\" rel=\"nofollow\">https://api.githubcopilot.com/</a>. New versions of the Copilot extension already route chat traffic through <a href=\"https://api.githubcopilot.com/\" rel=\"nofollow\">https://api.githubcopilot.com/</a>.</p>\n<p dir=\"auto\">Please ensure your firewall and network settings allow communication to <a href=\"https://api.githubcopilot.com/\" rel=\"nofollow\">https://api.githubcopilot.com/</a> in order for Copilot Chat to continue working on February 1, 2024.</p>\n<p dir=\"auto\">For more information, see the <a href=\"https://docs.github.com/en/enterprise-cloud@latest/copilot/troubleshooting-github-copilot/troubleshooting-firewall-settings-for-github-copilot\">Troubleshooting firewall settings for GitHub Copilot documentation</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/843",
            "title": "Deprecation of Copilot Proxy Chat API Endpoints",
            "date_modified": "2023-12-20T18:19:17.000Z",
            "date_published": "2023-12-20T18:18:23.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Enterprise customers can now set up Actions to connect with their internal networks. GitHub has introduced a turnkey set of tools that allow enterprise admins to give GitHub Actions access to the resources their teams need inside their private networks. This means that teams can now access their internal APIs, Databases, Artifactory instances and more from GitHub’s hosted runners.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Using GitHub-hosted runners within Azure VNET allows you to perform the following actions.</p>\n<ul dir=\"auto\">\n<li>Privately connect a runner to resources inside an Azure VNET without opening internet ports, including on-premises resources accessible from the Azure VNET.</li>\n<li>Restrict what GitHub-hosted runners can access or connect to with full control over outbound network policies.</li>\n<li>Monitor network logs for GitHub-hosted runners and view all connectivity to and from a runner.</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">To facilitate communication between GitHub networks and your VNET, a <a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/configuration/configuring-private-networking-for-hosted-compute-products/about-using-github-hosted-runners-in-your-azure-virtual-network#about-network-communication\">GitHub-hosted runner's network interface card (NIC) deploys into your Azure VNET</a>. Enterprise and organization admins can configure Azure private networking by creating one or more network configurations with desired Azure VNETs. Once created, network configurations can be associated with required runner groups for underlying runners to inherit the networking policies.</p>\n<p dir=\"auto\"><a href=\"https://docs.github.com/en/enterprise-cloud@latest/admin/configuration/configuring-private-networking-for-hosted-compute-products/about-networking-for-hosted-compute-products\">Learn more about Azure private networking ad network configurations here. </a></p>",
            "url": "https://github.com/github/roadmap/issues/842",
            "title": "GitHub-hosted runners: Private networking for secure connections to customer Azure VNETs",
            "date_modified": "2023-12-20T18:19:15.000Z",
            "date_published": "2023-12-20T18:18:19.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Improvements to the GitHub Actions user interface are coming to enhance navigability and ease-of-use for projects of any size. The first set of changes will be focused on the list of workflows in the Actions tab. The new experience will make it easier to search for and find workflows. This is a multi-quarter initiative with changes planned across the user interface.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Large and complex CI/CD pipelines can often have dozens of workflow files, with only a handful being interacted with on a regular basis. The changes we're making in this initiative will make it easier for customers to find and navigate to specific workflows, regardless of the project size.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">The UI changes will include a search box for the list of workflows, the ability to pin a workflow to the top of the list, indicators to separate out disabled workflows, and other improvements for readability.</p>",
            "url": "https://github.com/github/roadmap/issues/841",
            "title": "Actions: Workflow List UI Improvements",
            "date_modified": "2023-12-20T18:19:14.000Z",
            "date_published": "2023-12-20T18:18:16.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning-with-codeql\">CodeQL analysis engine</a> for <a href=\"https://docs.github.com/en/code-security/code-scanning/automatically-scanning-your-code-for-vulnerabilities-and-errors/about-code-scanning\">GitHub code scanning</a> will be able to analyze projects built with C# 12 / .NET 8.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Currently, CodeQL supports <a href=\"https://codeql.github.com/docs/codeql-overview/supported-languages-and-frameworks/\"> language features up to and including </a> C# 11 / .NET 7. A new C# version 12 and .NET version 8 are due to be released before the end of 2023. Adding support to CodeQL will allow users of C# 12 / .NET 8 to benefit from CodeQL's comprehensive security analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">If a project contains code that uses C# 12 / .NET 8, CodeQL will be able to scan the code. As soon as the analysis is finished, the CodeQL results will become visible to you in the \"Security\" tab and on pull requests. C# 12 / .NET 8 support will also be available through the <a href=\"https://codeql.github.com/docs/codeql-cli/about-the-codeql-cli/\">CodeQL CLI</a> and <a href=\"https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-codeql\" rel=\"nofollow\">CodeQL VS Code extension</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/840",
            "title": "Code scanning with CodeQL supports C#12 / .NET 8",
            "date_modified": "2023-12-20T18:19:13.000Z",
            "date_published": "2023-12-20T18:18:14.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Previously, an actively running Actions' job would only stream the logs generated after the page was loaded. Logs emitted prior to the page loading would only be available after the job completed. This made it challenging to monitor the progress of jobs as they were running, particularly those that could take a long time to complete.</p>\n<p dir=\"auto\">This feature includes improvements to the way we stream logs and will also show the previous 1,000 lines when visiting the logs of an actively running job.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers will now be able to visit the logs of a running job and immediately get context of its progress and status. This enable developers to understand if a workflow is behaving as expected much faster.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Upon visiting the logs of an actively running Actions jobs, customers will now see the previous 1,000 lines of logs and any new lines emitted thereafter.</p>",
            "url": "https://github.com/github/roadmap/issues/839",
            "title": "GitHub Actions: Streaming Logs & Scrollback",
            "date_modified": "2023-12-20T18:19:12.000Z",
            "date_published": "2023-12-20T18:18:11.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">It's no easy feat to search and triage issues across repositories when you have many teams working towards a shared goal. Issue types will allow users to classify and manage different types of issues across repositories.</p>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/94867353/265118999-2b2968f8-0e40-4562-adc6-5dcad851bd9c.png\"><img src=\"https://user-images.githubusercontent.com/94867353/265118999-2b2968f8-0e40-4562-adc6-5dcad851bd9c.png\" alt=\"Image\" style=\"max-width: 100%;\"></a></p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Some folks have tried to use labels in order to do this - however labels are tied to repositories and label syntax can drift across repos. This makes triaging issues across repos difficult.</p>\n<p dir=\"auto\">We believe that by creating a shared language to standardize work items across repositories we'll unlock reporting and automation use-cases.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to define issue types (ex. bug, feature request, spike) at the org level and apply this syntax to an issue in a repo.</p>",
            "url": "https://github.com/github/roadmap/issues/837",
            "title": "Issues: Issue Types",
            "date_modified": "2023-11-08T20:09:44.000Z",
            "date_published": "2023-11-08T20:09:03.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The GitHub-hosted runner portfolio is expanding to include Arm-based hosted runners. These runners will be fully managed by GitHub with a base image containing a foundational set of tools. Powered by the Ampere Altra Arm–based processor, these runners offer a power efficient compute layer which can increase price to performance ratios, allowing customers to optimize compute costs.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Customers are refactoring their applications to take advantage of the price performance benefits of ARM architecture. Developers can now run their workloads on Arm-based hardware hosted by GitHub to build and deploy their release assets anywhere Arm’s architecture is used. These new runners provide power, performance &amp; sustainability improvements for all your Actions jobs.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">To get started using Arm-based GitHub-hosted runners, create a runner in a runner group choosing Arm as the hardware. Then update the <code class=\"notranslate\">runs-on:</code> key in your Actions workflow YAML to have those jobs target the new runner.</p>\n<p dir=\"auto\">To sign up, please visit <a href=\"https://resources.github.com/devops/accelerate-your-cicd-with-arm-and-gpu-runners-in-github-actions/\">this link</a>.</p>",
            "url": "https://github.com/github/roadmap/issues/836",
            "title": "GitHub Actions: Arm based hosted runners (Limited Beta)",
            "date_modified": "2023-11-08T20:09:43.000Z",
            "date_published": "2023-11-08T20:09:00.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h2 dir=\"auto\">Summary</h2>\n<p dir=\"auto\">Customers using GitHub Enterprise Importer, depending on the configuration of their systems, may need to add GitHub's IP addresses to various IP allow lists for migrations to work.</p>\n<p dir=\"auto\">This isn't just GitHub's IP allow list - other IP allow lists can also be involved, for example on Azure DevOps (for migrations from ADO) or AWS S3/Azure Blob Storage storage (for migrations from GitHub Enterprise Server or Bitbucket Data Center/Server).</p>\n<p dir=\"auto\">We're introducing a new IP range, <code class=\"notranslate\">20.125.12.8/29</code>, that customers will need to add to their allow list(s) by November 8, 2023.</p>\n<p dir=\"auto\">If you use IP allow listing on your GitHub enterprise/organization, Azure DevOps organization or blob storage account, and you haven't updated your allow lists by November 8, your migrations may start to fail.</p>",
            "url": "https://github.com/github/roadmap/issues/835",
            "title": "Updated IP ranges for GitHub Enterprise Importer (October 2023)",
            "date_modified": "2023-11-08T20:09:41.000Z",
            "date_published": "2023-11-08T20:08:57.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">On January 8, 2024, we will turn off Subversion support in GitHub.com. We will also turn off Subversion support in the first GitHub Enterprise Server release after January 8, 2024.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Subversion support is little-used by customers (in aggregate) but represents an above-average ongoing support and maintenance burden. Removing it will free up resources to focus on features and support more relevant to the vast majority of our customers.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">After a few brownouts, we will remove the code which powers Subversion support.</p>",
            "url": "https://github.com/github/roadmap/issues/834",
            "title": "Sunset Subversion support",
            "date_modified": "2023-11-08T20:10:55.000Z",
            "date_published": "2023-11-08T20:08:54.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}