{
    "version": "https://jsonfeed.org/version/1",
    "title": "github/roadmap Issues",
    "home_page_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "feed_url": "https://azu.github.io/github-search-rss/github-roadmap.json",
    "description": "github/roadmap Issues on GitHub",
    "items": [
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Currently, projects can only support 1200 active items and 10,000 archived items but we've heard from many larger teams that these limits are too low for the work they need to track such as long-running backlogs. While we can't completely remove the limit for projects, we will raise the limit to approximately 50k active items to better support this scenario.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">For long running projects or all-encompassing backlogs for companies, the current limit for project items is too constricting. In order to better serve our large team and enterprise customers, we need to increase this limit so that their projects can grow as they do.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Projects will work as they do now, just with a higher upper limit on active items.</p>",
            "url": "https://github.com/github/roadmap/issues/776",
            "title": "Projects: Increase project item limit ",
            "date_modified": "2023-05-10T18:09:48.000Z",
            "date_published": "2023-05-10T18:09:01.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">When upgrading to a new version of GHES we do not provide any information about how the upgrade is progressing. We know that running the necessary database migrations is one of the longest parts of any upgrade, so we want to provide more insight into how this step of the upgrade is progressing.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Starting in GitHub Enterprise Server 3.9, enterprise administrators will be able to see the progress of the migrations that are running as part of an upgrade <strong>in real time</strong>.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">We will print concise and easy-to-read information to the SSH console about the migrations that are running during an upgrade. Administrators will be able to monitor this information <strong>in real time</strong> to see how the migrations are progressing.</p>",
            "url": "https://github.com/github/roadmap/issues/775",
            "title": "GitHub Enterprise Server: See how migrations are progressing during an upgrade",
            "date_modified": "2023-05-10T18:09:46.000Z",
            "date_published": "2023-05-10T18:08:56.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Today, there is no way for consumer of individual actions to determine its trustworthiness and quality, other than analyzing whether it comes from a verified creator. Enterprises have been asking for actions that follow standards (e.g: CodeQL, timely dependency updates, etc.).</p>\n<p dir=\"auto\">When this work is complete, we will automatically run checks on repositories hosting published Actions to determine if the repository where the Action is hosted follows security best practices. We use a subset of OpenSSF (Open Source Security Foundation) scorecard checks to make this determination and publish that metadata as part of the Action listing page and details.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">We are building this to continue our credibility with customers that GitHub is serious about security. With 17K actions on the Marketplace and more getting added every day, it's imperative that we surface the necessary metadata for  consumers to be able to make decisions about what actions they can rely on.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Whenever there's a state change in a repository (based on certain rules) a dynamic workflow is kicked off to run the checks. The results from the scoring are then surfaced on to the listing page. Since it's a new change, once we go GA, we will give action creators a grace period to make any desired changes, after which the results will be automatically published to the listing details page. New actions authored and published after the GA date will automatically get graded.</p>\n<p dir=\"auto\">These checks against a repository that's hosting the action will evaluate holistic security practices, source risk assessment and build risk assessment.</p>",
            "url": "https://github.com/github/roadmap/issues/774",
            "title": "Automatic security check information on each Actions listing",
            "date_modified": "2023-05-10T18:05:57.000Z",
            "date_published": "2023-05-10T18:05:20.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Previously, customers needed to store this configuration data as encrypted secrets in order to reuse values in Actions features like reusable workflows. While extremely secure, this method did not allow for easy storage and retrieval of non-sensitive configuration data such as compiler flags, usernames, or server names.</p>\n<p dir=\"auto\">Configuration variables allow you to store your non sensitive data as plain text variables that can be reused across your workflows in your repository or organization. You can define variables at Organization, Repository, or Environment level based on your requirement.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<ul dir=\"auto\">\n<li>Configuration variables help developers define their non-sensitive information as plain text variables that can be consumed across multiple workflows in the repository.</li>\n<li>Configuration variables allows you to define default parameters for tools like our Java compiler at an organization level, but permit individual development teams to override them as they see fit.</li>\n<li>Configuration variables help DevOps team to provide a ‘golden path’ for build and deployment patterns while still allowing customization and control by the developers we support.</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<ul dir=\"auto\">\n<li>Customer can create new Variables at Organization, Repository and Environment level.</li>\n<li>Customers can refer to the value of the variable in the workflow documents using the contruct <code class=\"notranslate\">${{vars.&lt;variable name&gt;}}</code></li>\n<li>The inheritance model for variables i.e. Org, Repo, Env work similar to secrets.</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/773",
            "title": "GitHub Actions configuration variables - GA",
            "date_modified": "2023-05-10T18:05:56.000Z",
            "date_published": "2023-05-10T18:05:16.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Previously, to create a <a href=\"https://docs.github.com/en/actions/using-workflows/creating-starter-workflows-for-your-organization#creating-a-starter-workflow\">custom starter workflow</a>, customers needed to add their starter workflows to a public .github repository in their organization. However, organizations don't want to maintain their custom starter workflows in a public repository. Now, org admins have control to choose their own repository(s) (public/private/internal) in the organization to store their custom starter workflows. Any workflow stored in starter-workflows folder in the chosen repositories will be shown as a org suggested starter workflows for the developer.</p>\n<p dir=\"auto\">And we are also enhancing the new workflow experience in the repository. You will see a dedicated page for showing organization starter workflows.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Org admins can choose specific repositories (public, private, internal) of their choice to maintain their custom starter workflows. Developers can see the org suggested starter workflows when they try to create a new workflow.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<ul dir=\"auto\">\n<li>Org admin configures the set of repositories to use for storing starter workflows.</li>\n<li>Team members can contribute and store the starter workflows in the starter-workflows folder in the chosen repositories.</li>\n<li>The visibility of the repository decides in what repositories the starter workflow shows up as a suggestion.</li>\n<li>When a developer clicks on new workflow in a repository, he/she can see the org suggested starter workflows in a separate section.</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/772",
            "title": "GitHub Actions Starter workflow improvements",
            "date_modified": "2023-05-10T18:05:55.000Z",
            "date_published": "2023-05-10T18:05:13.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are now adding support for built-in protection rules which can be natively enabled on all environments. These would compliment the community powered custom protection rules which are powered by GitHub Apps.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Built-in protection rules enable us to provide key CD capabilities within \"environments\" by default. These preempt the experience for “discovery” and “installation” needed by custom rules powered by \"GitHub Apps\".</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Built-in protection rules make “Environments” more robust with native gating capabilities which tie into the other GitHub features that we support across our product.</p>",
            "url": "https://github.com/github/roadmap/issues/771",
            "title": "Actions: Built-in deployment protection rules (gates)",
            "date_modified": "2023-05-10T18:05:54.000Z",
            "date_published": "2023-05-10T18:05:10.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">GitHub Actions Importer helps users plan, forecast, and automate the migration of their existing CI/CD pipelines to GitHub Actions. With this update, we will be adding support for Bamboo. Bamboo users can migrate their pipelines to GitHub Actions easily and for free using the official GitHub CLI.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<ul dir=\"auto\">\n<li>Simplify the pipeline migration process for Bamboo users by automating manual and tedious steps</li>\n<li>Reduce the potential for errors during migration and speed up development teams</li>\n</ul>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users will be able to migrate existing Bamboo pipelines to GitHub Actions using the <code class=\"notranslate\">audit</code>, <code class=\"notranslate\">forecast</code>, <code class=\"notranslate\">dry-run</code>, and <code class=\"notranslate\">migrate</code> subcommands of <code class=\"notranslate\">gh actions-importer</code></p>",
            "url": "https://github.com/github/roadmap/issues/770",
            "title": "GitHub Actions Importer - Bamboo Migrations",
            "date_modified": "2023-05-10T18:06:21.000Z",
            "date_published": "2023-05-10T18:05:07.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Dependabot alerts now proactively filters out false positives from your alert list -- so true positives are no longer buried under a mountain of unimportant alerts.</p>\n<p dir=\"auto\">In this release we will automatically dismiss alerts for npm devDependencies where the vulnerability is low impact. Low impact alerts are unlikely to be exploitable or may only have limited effects like slow builds or long-running tests.</p>",
            "url": "https://github.com/github/roadmap/issues/769",
            "title": "Safe auto-dismissals for Dependabot alerts (low impact npm devDependencies)",
            "date_modified": "2023-05-10T18:27:12.000Z",
            "date_published": "2023-05-10T18:02:51.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">With this feature, any developer who manages their project dependencies using the pnpm package manager will be able to get Dependabot version updates for these dependencies. Security updates for pnpm will not be supported at this time.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">This increases the number of ecosystems supported by Dependabot version updates and increases our market of potential users.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">You will be able to configure Dependabot to update versions of dependencies defined in the pnpm package manager.</p>",
            "url": "https://github.com/github/roadmap/issues/768",
            "title": "pnpm support for Dependabot Updates",
            "date_modified": "2023-05-10T18:03:25.000Z",
            "date_published": "2023-05-10T18:02:48.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Dependabot now proactively filters out false positives from your alert list -- so true positives are no longer buried under a mountain of unimportant alerts.</p>\n<p dir=\"auto\">Dependabot's default auto-dismissal rules cover development-scoped (devDependency) alerts where the vulnerability is low impact. Low impact alerts are unlikely to be exploitable or may only have limited effects like slow builds or long-running tests.</p>\n<p dir=\"auto\">For developers that need more control, custom rules are a powerful way to manage your alerts. This release adds ability to manage default presents and define your own auto-dismiss rules.</p>",
            "url": "https://github.com/github/roadmap/issues/767",
            "title": "Dependabot alerts: complex auto-dismiss rules",
            "date_modified": "2023-05-10T18:03:23.000Z",
            "date_published": "2023-05-10T18:02:45.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">With this release, users can enjoy the same user-friendly design that they have come to know and love at the organization level, but now with the added benefit of being able to access security risk and coverage data across all the organizations in their enterprise.</p>\n<p dir=\"auto\">To access these new enterprise-level pages, users will need to navigate to the Code Security tab for their enterprise. Only enterprise owners, organization owners and security managers will have the ability to access these views.  They will only see data for organization repositories where they are an organization owner or security manager. Enterprise owners will need to join an organization as an organization owner to see all of the associated organization repositories.</p>",
            "url": "https://github.com/github/roadmap/issues/766",
            "title": "Enterprise-level security risk and coverage views",
            "date_modified": "2023-05-10T18:03:22.000Z",
            "date_published": "2023-05-10T18:02:42.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">The dependency review API and will now include dependencies submitted via the dependency submission API. The <a href=\"https://github.com/actions/dependency-review-action\">dependency review action</a> will also consider dependencies submitted via the dependency submission API, and will fail if a PR introduces dependencies with known vulnerabilities.</p>",
            "url": "https://github.com/github/roadmap/issues/765",
            "title": "Dependency review works with dependencies submitted with the dependency submission API ",
            "date_modified": "2023-05-10T18:03:21.000Z",
            "date_published": "2023-05-10T18:02:39.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">This release enables organization administrators to archive an entire organization at once. Archiving an organization will make all the repositories in the org read-only, prevents the creation of new repositories, and adds a banner at both the org profile level and each repo indicating that it is archived.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Enterprises with deep usage of GitHub often end up with a confusing and hard-to-manage proliferation of organizations that can number in the dozens or even hundreds. Internally, we had 106 open source orgs at the beginning of the year! Many of these are stale or obsolete, but currently there is no easy way to archive a once-active organization: you have to individually archive each repository in the org, and even then the top-level org still permits repo creation, new teams, etc. This adds to the toil of enterprise administration and makes for an inconsistent, unpleasant experience for open source maintainers, OSPO managers, and IT teams responsible for managing their GitHub presence.</p>\n<p dir=\"auto\">Our new feature lightens this administrative burden.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">This will add a button to the Organization Settings \"Danger Zone\" which will:</p>\n<ul dir=\"auto\">\n<li>archive all the repositories in the organization</li>\n<li>set a key in the API to indicate the org has been archived</li>\n<li>restrict most activities in that organization such as creating new repos</li>\n</ul>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/github/roadmap-internal/assets/56753/fec57dfa-4fa2-4565-89b7-f555a0fe9726\"><img src=\"https://github.com/github/roadmap-internal/assets/56753/fec57dfa-4fa2-4565-89b7-f555a0fe9726\" alt=\"image\" style=\"max-width: 100%;\"></a></p>",
            "url": "https://github.com/github/roadmap/issues/764",
            "title": "Organization archiving",
            "date_modified": "2023-05-10T18:03:20.000Z",
            "date_published": "2023-05-10T18:02:36.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We'll provide an API that allows organization admins to be able to add and remove user access to Copilot and automate getting a flat list of users and their last activity date.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">As Copilot for Business is adopted by larger and larger organizations, adding and removing large sets of users can become cumbersome. Admins want the ability to automate or perform the bulk action of the addition/removal of their user's access to Copilot. They also want be able to create a flat list of users and their last activity date in order to find dormant users who can have their access removed.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Organization admins will need to create a fine-grained access token that allows them to make API calls that will list, add, or remove users for Copilot Access.</p>",
            "url": "https://github.com/github/roadmap/issues/763",
            "title": "Copilot User Management API",
            "date_modified": "2023-05-10T18:03:19.000Z",
            "date_published": "2023-05-10T18:02:33.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are providing users with the ability to perform bulk-edits to their board items. This includes updated keyboard shortcuts to navigate through their board and make adjustments to the board items within and between a column, as well as support for multi-select drag and drop to update multiple items at once.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Supporting multi-select drag and drop will allow users to quickly make adjustment to their items when planning out and updating their work, such as moving multiple items from <code class=\"notranslate\">In progress</code> to <code class=\"notranslate\">Done</code> in a single action. Providing keyboard shortcuts to navigate the board and update items will make it easy to quickly change where an item ranks within a column, as well moving it to a different column.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Select multiple board items to drag and drop them from one column to another, or utilize keyboard shortcuts to move an item within a column or to a different column.</p>",
            "url": "https://github.com/github/roadmap/issues/762",
            "title": "Projects: Bulk edit items in board layout",
            "date_modified": "2023-05-10T18:03:18.000Z",
            "date_published": "2023-04-11T18:02:05.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">We are updating the Projects header by surfacing project view configurations directly from the view, rather than within the view configuration dropdown menu. This includes options such as sorting, grouping, and visible fields. This will allow users to easily set up and configure their project views by making them more discoverable, accessible, and easy to use.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">We want to make it easy for users to set up and configure their project, as well as knowing how an existing project is set up. Updating the Projects header to include more customizations directly from the view will make these less confusing and less hidden.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">When a user creates a new project or updates an existing project, they will be able to explore and use the view-level customizations from a more visible and discoverable location, so they can select and configure options such as their <code class=\"notranslate\">sort</code> field, <code class=\"notranslate\">group</code> field, or visible <code class=\"notranslate\">fields</code> to display on the view. When creating a new project view, a user will also be able to select the layout type directly.</p>",
            "url": "https://github.com/github/roadmap/issues/761",
            "title": "Projects: Updated Projects header",
            "date_modified": "2023-05-10T18:03:17.000Z",
            "date_published": "2023-04-11T18:02:02.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://user-images.githubusercontent.com/16281246/214384373-b99a25ef-bfd2-4ae8-b0f6-3803c96822f5.png\"><img src=\"https://user-images.githubusercontent.com/16281246/214384373-b99a25ef-bfd2-4ae8-b0f6-3803c96822f5.png\" alt=\"image\" style=\"max-width: 100%;\"></a></p>\n<p dir=\"auto\">Users will now have the ability to navigate, explore and work with a hierarchy of Issues on GitHub!</p>\n<h2 dir=\"auto\">Feature Highlights:</h2>\n<ul dir=\"auto\">\n<li>Tasklists are powered by a unique Markdown formatting and can easily be added to Issue Templates or created via the API</li>\n<li>Create multi-level hierarchies of Issues from the Issues page or GitHub Projects</li>\n<li>See relevant labels, assignees, and child issues in tasklists</li>\n<li>Explore the hierarchy using breadcrumbs in the Projects side-panel</li>\n<li>Keep track of Issue tasklist completion with the new \"Tracks\" and \"Tracked by\" columns in Projects</li>\n<li>Quickly edit Issue meta-data with in-line editing capabilities</li>\n</ul>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Managing software projects at scale can be challenging without Issue hierarchies. Customers want the ability to create large batches of work (sometimes called Epics) and break those batches down into smaller more manageable tasks; all while tracking progress in a single GitHub Issue or from GitHub Projects.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">See docs: <a href=\"https://docs.github.com/en/issues/tracking-your-work-with-issues/about-tasklists\">https://docs.github.com/en/issues/tracking-your-work-with-issues/about-tasklists</a></p>\n<p dir=\"auto\">In short, custom Markdown formatting with custom rendering, will allow users to create structured Hierarchies of Issues.</p>\n<hr>\n<p dir=\"auto\">If you'd like to gain early access, sign up for the Private Beta here: <a href=\"https://github.com/features/issues/signup\">https://github.com/features/issues/signup</a></p>",
            "url": "https://github.com/github/roadmap/issues/760",
            "title": "[Public Beta] Issue Hierarchy powered by Tasklists",
            "date_modified": "2023-05-10T18:09:45.000Z",
            "date_published": "2023-04-10T21:39:58.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Code scanning default setup will now also analyze the repository's default branch following a pre-configured schedule (like <a href=\"https://docs.github.com/en/actions/using-workflows/events-that-trigger-workflows#schedule\">GitHub Actions' <code class=\"notranslate\">on: schedule</code> trigger</a>).</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Analyzing the default branch on schedule ensures that a repository's code is scanned and protected even when it is not actively contributed to. This means that repositories will automatically benefit from updates to the CodeQL analysis, even when there are no code changes. This brings the CodeQL default setup configuration in line with the CodeQL starter workflow.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Code scanning default setup sets up CodeQL on a repository without committing a workflow file. This now also analyzes the default branch on weekly schedule. This brings the CodeQL default setup configuration in line with the CodeQL starter workflow.</p>",
            "url": "https://github.com/github/roadmap/issues/759",
            "title": "Code scanning default setup scans `on:schedule`",
            "date_modified": "2023-05-10T18:09:44.000Z",
            "date_published": "2023-04-10T21:39:51.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Users can optionally select the <code class=\"notranslate\">security-extended</code> query suite for analyzing their code code through the code scanning default setup configuration.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">Allow repositories to increase query suite coverage in their default setup analysis.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<p dir=\"auto\">Users can manually choose to analyze the <code class=\"notranslate\">security-extended</code> query suite in the code scanning default setup configuration. This query suite will be in addition to the default query suite. <code class=\"notranslate\">security-extended</code> query suite will not be analyzed unless explicitly included in the configuration settings by the user. It will also be possible to change the query suite selection after initial setup.</p>",
            "url": "https://github.com/github/roadmap/issues/758",
            "title": "Code scanning default setup makes it possible to use `security-extended` CodeQL query suite",
            "date_modified": "2023-05-10T18:09:43.000Z",
            "date_published": "2023-04-10T21:39:48.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        },
        {
            "content_html": "<img src=\"https://avatars.githubusercontent.com/u/67656570?u=71034939d8d88be6d9b9068038dfdc8158fa69c0&v=4\" width=\"64\" height=\"64\" alt=\"\"/><br/><h3 dir=\"auto\">Summary</h3>\n<p dir=\"auto\">Most of the GHES customers are set up in HA mode, and many of them (especially larger customers) have geo replication and multiple HA replicas in their configuration. However, we have seen many issues with setup / configure / teardown / failover with multiple replicas. For example: GHES HA failover not working when the primary is unavailable. This impacts the customer experience and deteriorates the perceived reliability of the system.</p>\n<h3 dir=\"auto\">Intended Outcome</h3>\n<p dir=\"auto\">The efforts we have planned this quarter will make HA configuration scripts much more reliable, we will improve error handling, and handle failover scenarios more gracefully.</p>\n<h3 dir=\"auto\">How will it work?</h3>\n<ul dir=\"auto\">\n<li>Improve connection checks and reliability of <code class=\"notranslate\">ghe-repl-*</code> commands</li>\n<li>Better error handling for offline replicas</li>\n<li>Reliable teardown if primary or any of the replicas are not accessible</li>\n<li>Prevent <code class=\"notranslate\">ghe-config-apply</code> from running if replica is not fully setup</li>\n</ul>",
            "url": "https://github.com/github/roadmap/issues/757",
            "title": "GHES HA Offering Improvements",
            "date_modified": "2023-05-10T18:05:51.000Z",
            "date_published": "2023-04-10T21:37:37.000Z",
            "author": {
                "name": "github-product-roadmap",
                "url": "https://github.com/github-product-roadmap"
            }
        }
    ]
}